[
  {
    "id": "m-1561969",
    "tmdb_id": 1561969,
    "media_type": "movie",
    "title": "Baramulla",
    "overview": "A cop's inquiry into child kidnappings unravels chilling secrets as supernatural events endanger his family and the peaceful town of Baramulla.",
    "release_date": "2025-11-06",
    "poster_path": "/6Qc0wDC0NDqi8Bzyh7i2sWViR6V.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-1109086",
    "tmdb_id": 1109086,
    "media_type": "movie",
    "title": "War 2",
    "overview": "Years ago Agent Kabir went rogue, became India’s greatest villain ever.  As he descends further into the deepest shadows... India sends its deadliest, most lethal agent after him, Agent Vikram  A Special Units Officer who is more than Kabir’s equal and a relentless Terminator driven by his own demons, determined to put a bullet into Kabir’s skull.",
    "release_date": "2025-08-13",
    "poster_path": "/2Yc8Kl2ldPpDzLrG2M5Ddv62FXB.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-4252",
    "tmdb_id": 4252,
    "media_type": "movie",
    "title": "Chalte Chalte",
    "overview": "A man pursues a woman who is already engaged and eventually gets married to her. Differences between the two lead to a bitter separation that threatens to destroy their relationship forever.",
    "release_date": "2003-06-12",
    "poster_path": "/7eux23WmDXUkmgLdMdxuuFn9II4.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-63006",
    "tmdb_id": 63006,
    "media_type": "movie",
    "title": "Dum Maaro Dum",
    "overview": "ACP Vishnu is sent on a mission to investigate and clean the underbelly of Goa. During his investigation, he uncovers a huge racket and discovers the involvement of various politicians.",
    "release_date": "2011-04-22",
    "poster_path": "/uzqKhhSA6ypWwqsnZSwCs7C42sb.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-26815",
    "tmdb_id": 26815,
    "media_type": "movie",
    "title": "Rocket Singh: Salesman of the Year",
    "overview": "Rocket Singh: Salesman of the Year is the sometimes thoughtless, sometimes thoughtful story of a fresh graduate trying to find a balance between the maddening demands of the 'professional' way, and the way of his heart - and stumbling upon a crazy way which turned his world upside down, and his career right side up. Welcome to the world of sales boss!",
    "release_date": "2009-12-11",
    "poster_path": "/3Z8lLFzPOBfOO4w3CykRaCeh9h.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-618473",
    "tmdb_id": 618473,
    "media_type": "movie",
    "title": "Khandaani Shafakhana",
    "overview": "When Baby Bedi is entrusted with a job of running controversial sex clinic ‘Khandaani Shafakhana’, in a small town of Punjab, she faces severe backlash from all quarters. Can she find a cure for the widespread social stigma against important issues like sex education and sexual health?",
    "release_date": "2019-08-02",
    "poster_path": "/nlejxxxLsVZxbZd61zT7JH2z1wA.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-988988",
    "tmdb_id": 988988,
    "media_type": "movie",
    "title": "Judaa Hoke Bhi",
    "overview": "Aman Khanna, a once successful singer, is drowning his life into alcohol, despair and self- destruction after his 6 years old son died in a freak accident. Aman's wife, Meera who has an autobiographical bestseller to her credit is trying to cope with their financial burdens and Aman's lack of responsibility.",
    "release_date": "2022-07-15",
    "poster_path": "/6ow6lvYQWrEwNlvPYvpcjoVwYbC.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-1035366",
    "tmdb_id": 1035366,
    "media_type": "movie",
    "title": "Rocket Gang",
    "overview": "Five friends take a getaway trip and stay at Wonder Villa. But, the haunted villa's supernatural powers suck them in and their only chance to survive is by dancing.",
    "release_date": "2022-11-11",
    "poster_path": "/8icRtVuWUDvBITWCeMBmRTL8chu.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-407547",
    "tmdb_id": 407547,
    "media_type": "movie",
    "title": "Beiimaan Love",
    "overview": "A  young and ambitious woman's life suddenly comes crashing down when she is betrayed in love. Determined to get revenge she reinvents herself as a successful businesswoman.",
    "release_date": "2016-08-05",
    "poster_path": "/xgNAJbjfaQE9mp8ffGY1TSot13G.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-71920",
    "tmdb_id": 71920,
    "media_type": "movie",
    "title": "LOC: Kargil",
    "overview": "This film dramatizes events that occurred as the hostility between India and Pakistan over Kashmir came to a head in 1999, when more than 1,000 men crossed the \"Line of Control\" that separates the two locations. Taliban and Pakistani soldiers took over the area, blocking the main road that linked the regions. Standing their ground, Indian soldier drove them away, but not without losing more than 400 of their own men first.",
    "release_date": "2003-12-12",
    "poster_path": "/8rwlGnSWgLJlveO4OoOJ2n2YZyv.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-590351",
    "tmdb_id": 590351,
    "media_type": "movie",
    "title": "72 Hours: Martyr Who Never Died",
    "overview": "The story is based on the life of Rifleman Jaswant Singh Rawat. 55 years ago during 1962 Indo-China war , when the destiny of war was pre decided, there stood a brave soldier from 4th Garhwal Rifle against all odds and guarded our post from Nurunaang Base in Arunachal Pradesh then called NEFA border.",
    "release_date": "2019-01-19",
    "poster_path": "/hDGpgkka0QX0eMBklXY9E0Xub1W.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-471265",
    "tmdb_id": 471265,
    "media_type": "movie",
    "title": "Dastan",
    "overview": "Indira (Suraiya) is an orphan brought up the strict and uprighteous Rani (Veena). Indira grows up to be a beauty and is sought by three suitors Raj (Raj Kapoor), Kundan (Al Nasir), and Ramesh (Suresh). Rani does not like Indira to marry into her family as both Raj and Kundan are her brothers, and she wants Indira to marry Ramesh, and as such arranges a meeting with Ramesh's mom (Pratima Devi) and finalizes the marriage. Indira does not appreciate this and refuses to marry Ramesh. Raj speaks of his love with Rani, and Rani warns him that Indira is to marry Ramesh, but also has an on-going affair with his brother Kundan. Who does Indira really love? Will she ever marry her dream man?",
    "release_date": "1950-08-17",
    "poster_path": "/1ffOHbjdQEzt1nDyGS0TQyDG7QU.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-407815",
    "tmdb_id": 407815,
    "media_type": "movie",
    "title": "Banphool",
    "overview": "Haria lives with his widowed and elderly grandmother at a tea estate and works as Elephant Driver. He has no knowledge of his biological father, as his mother died at the time of his birth. He meets and falls in love with a gypsy girl, Gulabi, and both want to get married. But Gulabi has another suitor, none other than Ajay, the only son of the tea estate owner. When Ajay finds out that Gulabi loves Haria, he plans to get rid of Haria, but fails. He waits for the right moment, and has his men abduct Gulabi. But before he could have his way with her, she is rescued by Raja, but Ajay subsequently shoots Raja to death. An enraged Haria wants to kill Ajay in return, but Ajay's dad stops him from doing so. Then Ajay's dad finds out a secret about his past life, and decides to change his last will and testament. Ajay finds out about this and lays in wait with a shotgun to kill his very own father - and anyone else who dares to stand in his way",
    "release_date": "1971-12-31",
    "poster_path": "/tEQPeJU9j0eOKIn0QPKURKqe39M.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-1196946",
    "tmdb_id": 1196946,
    "media_type": "movie",
    "title": "Ikkis",
    "overview": "Set against the backdrop of the 1971 war, follows the life of second Lieutenant Arun Khetrapal.",
    "release_date": "2025-12-25",
    "poster_path": "/70edzATxyOYtIMH1VtBrlvWL0bO.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-215776",
    "tmdb_id": 215776,
    "media_type": "movie",
    "title": "Madras Cafe",
    "overview": "An Indian intelligence agent journeys to a war-torn coastal island to break a resolute rebel group and meets a passionate journalist.",
    "release_date": "2013-08-23",
    "poster_path": "/3cfFqEuj2ynHUb0FTBThTh0gQB9.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-167595",
    "tmdb_id": 167595,
    "media_type": "movie",
    "title": "Superman",
    "overview": "In this Indian take on the classic superhero story, a young baby from the doomed planet Krypton is sent to Earth, where he is adopted by an elderly couple in India who name him Shekhar. After growing to an adult and learning about his origins and powers, he goes to the city in search of his school sweetheart, Gita, who has become a newpaper reporter. At the same time, Verma, Shekhar's rival for Gita's affection in their school days, has gone on to become a crime lord and general super-villain. Verma has hatched at plan to become rich by devastating part of India with natural disasters, then buying up all of the abandoned land. Will Superman/Shekhar be able to put a stop to Verma's evil plan? Will he win Gita's heart? Will he keep his double identity a secret?",
    "release_date": "1987-12-31",
    "poster_path": null,
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-1190511",
    "tmdb_id": 1190511,
    "media_type": "movie",
    "title": "Sitaare Zameen Par",
    "overview": "A disgraced basketball coach is given the chance to coach a team of players who are intellectually disabled as part of community services. Gulshan has apprehensions at first and feels out of place but soon realizes they just might have what it takes to make it to the national championships.",
    "release_date": "2025-06-20",
    "poster_path": "/adYjCJGSNiL7CIaDW3g0Bcg7r2Z.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-1196364",
    "tmdb_id": 1196364,
    "media_type": "movie",
    "title": "Thamma",
    "overview": "Two destined lovers battle supernatural forces, family ties, and nature itself to defend their forbidden romance in a mystical world where ancient powers and prophecies threaten to keep them apart.",
    "release_date": "2025-10-21",
    "poster_path": "/d1SbIg1r1eowrCWsxHO6BJqQQwN.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-656908",
    "tmdb_id": 656908,
    "media_type": "movie",
    "title": "Ramayana: Part One",
    "overview": "First part of the epic Ramayana Duology.",
    "release_date": "2026-11-06",
    "poster_path": "/vlYuhFSdmEwo4czE2eDdf2pJ10G.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-20971",
    "tmdb_id": 20971,
    "media_type": "movie",
    "title": "Zinda",
    "overview": "The film is about a man, who has been imprisoned for 14 years, who has been released and has four days to figure out why he was imprisoned in the first place.",
    "release_date": "2006-01-12",
    "poster_path": "/o5u3Rx0hFvPEGsZGTi3faAiIQMQ.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-482203",
    "tmdb_id": 482203,
    "media_type": "movie",
    "title": "Ghutan",
    "overview": "Ravi Kapoor (Aryan Vaid) manages a company owned by his wife Catherine (Hina Rehman), whom he doesn't love and constantly cheats on. And he now has his eyes on his secretary, Priya (Pooja Bharti). When Catherine learns what's going on, she confronts him. In the heated argument that follows, Ravi hits her and believes she's dead. Together with his friend, Jaggi (Tarun Arora), they take her body to the graveyard. Just as they're about ready to put it in the grave they realize Catherine isn't dead so they bury her alive. Catherine's ghost then returns for revenge.",
    "release_date": "2007-06-08",
    "poster_path": "/gutqECREVLxgeN5bf0MRWrgfOZR.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-62201",
    "tmdb_id": 62201,
    "media_type": "movie",
    "title": "Shahenshah",
    "overview": "Inspector Srivastav is framed by a wily and cunning gangster, J.K., and unable to prove his innocence, hangs himself, leaving behind his wife, and son, Vijay. Years later, Vijay has grown up and has joined the police force as an Inspector. Unlike his dad, he is corrupt and does accept bribes to turn a nelson's eye to crime. The City Police are assigned the task of apprehending a customed man called \"Shahenshah\", who operates at night and targets, tries and kills gangsters in a \"Judge and Executioner \"style. No one knows the real identity of Shahenshah, as he is feared by the police department, and respected by the poor and middle-class.",
    "release_date": "1988-01-29",
    "poster_path": "/g8noCys7ElC73lcluN4kDeUzhYQ.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-353429",
    "tmdb_id": 353429,
    "media_type": "movie",
    "title": "Jaanwar",
    "overview": "Sultan (Shakti Kapoor) adopted an orphan and named him Badshah (Akshay Kumar). Badshah grows up to be a criminal and his life was made difficult by Inspector Pradhan (Ashish Vidyarthi). Badshah's sidekick is Abdul (Ashutosh Rana). The only hope in Badshah's life is Sapna (Karisma Kapoor), whom he incidentally met. But circumstances lead Badshah to commit murder in public. During this experience, a child clangs to him and he took the child to Sapna. Before he could explain anything, Pradhan gets there and Badshah had to escape. He changed his name to Babu Lohar and becomes a blacksmith and loving father, to give the child a good future. However, after 7 years, he sees Abdul and Sultan again. Pradhan is still after him. When the child's parents find out about him, they ask Babu to return their child. Will he let the child go? Will the child go with his parents?",
    "release_date": "1999-12-24",
    "poster_path": "/hAdnoPTsd1uWXKtKNzHzhijg6j.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-19624",
    "tmdb_id": 19624,
    "media_type": "movie",
    "title": "Fashion",
    "overview": "A small-town girl finally realizes her dream of becoming a famous supermodel but soon finds out that there's a price for her glamorous new life.",
    "release_date": "2008-10-29",
    "poster_path": "/6PQyJUJ3Ny1AZegtL5OkUATCIcr.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-37403",
    "tmdb_id": 37403,
    "media_type": "movie",
    "title": "Agneepath",
    "overview": "A young boy's father is lynched before his eyes; fifteen years later he returns home for revenge.",
    "release_date": "1990-02-16",
    "poster_path": "/kKCWrcIi6pAXNvPnC1LWtV4hB8u.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-529217",
    "tmdb_id": 529217,
    "media_type": "movie",
    "title": "Bedardi",
    "overview": "Mumbai-based Saxena family consists of Professor Nirbhay, his wife Preeti, their school-going daughter Ritu and Nirbhay's college-going brother and sister, Vijay and Suman respectively. Vijay meets with fellow collegian Honey, and after a few altercations, they fall in love with each other. Vijay is introduced to Honey's maternal uncle, Bhagwandas, and he approves instantly. Honey's long-estranged brother, Kanhaiya, re-enters her life and asks her not to see Vijay anymore. Then the lives of the entire Saxena family change drastically when money allotted for Suman's marriage is stolen, and Vijay accepts a contract to kill a man named Gulla - not knowing that he is being set up to kill none other than Nirbhay himself.",
    "release_date": "1993-11-12",
    "poster_path": "/aUpU1X4yYpqjzEefl4QSLluAjXC.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-101820",
    "tmdb_id": 101820,
    "media_type": "movie",
    "title": "Junoon",
    "overview": "Nita lives a middle-class lifestyle with her mom and dad in Bombay, India, and works as a Surgeon in a hospital. She is of marriageable age, &amp; is in love with a struggling Musician/Singer named Ravi, much to the chagrin of her mom, who wants her to marry someone who is wealthy. One day a badly wounded male is admitted into the hospital, is pronounced dead, but recovers, and with Nita's help recuperates and is discharged. He visits Nita's home, introduces himself as wealthy Vikram Chauhan and asks her parents for the hand of Nita, who immediately accept. But Nita wants to marry Ravi and plans to elope with him. On that fateful day, Ravi fails to keep his appointment and a heartbroken Nita decides to get married to Vikram. The marriage takes place with great pomp and ceremony. When Ravi attempts to re-enter Nita's life, she forbids him. Little does she know that Ravi's plans had been sabotaged by none other than Vikram - who is in reality a human during daytime...",
    "release_date": "1992-09-18",
    "poster_path": "/uDLGI6LfkgxtvHsXdTyFRcHVoZU.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-370869",
    "tmdb_id": 370869,
    "media_type": "movie",
    "title": "Chetna",
    "overview": "A shy and reclusive young man, Anil Dhawan, gets to meet a prostitute, Seema, through his friends, Ramesh. Anil is very shy at the very first meeting with Seema, and then starts to cultivate a friendship with her. She responds also, and both fall in love. Anil proposes marriage, and Seema is delighted to accept. Anil has to go out of town for a four or five days. When he returns, he finds Seema has taken up drinking alcohol and smoking in a big way, and appears despondent, and non-chalant, making him wonder what had happened during his absence to make her regress in this manner.",
    "release_date": "1970-11-17",
    "poster_path": "/cTXLZ8EnIHqPJabHJ3vjFL0c5Bk.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-401739",
    "tmdb_id": 401739,
    "media_type": "movie",
    "title": "Bada Din",
    "overview": "It is Christmas Day in Calcutta and David Dawson is off to celebrate it with his sweetheart, Nandini Shom. The meeting does not go well as Nandini wants him to start working so that they can get married and start a family, while David wants a career as a musician. She tells him that she will never see him again. Despondent, he returns to his rented apartment and is chided by his landlady, Lillian, who threatens to have him evicted as he has been delinquent in paying his rent for over a year...",
    "release_date": "1998-06-11",
    "poster_path": "/mpq1Ivx17FXSpHKhl4szxyAT4cm.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-114711",
    "tmdb_id": 114711,
    "media_type": "movie",
    "title": "Aarti",
    "overview": "An unemployed young man named Deepak (Pradeep Kumar) saves Aarti Gupta (Meena Kumari), a hardworking and dedicated doctor, from drowning, and the two eventually fall in love with each other, although she is already engaged to Dr. Prakash (Ashok Kumar). Although Aarti's father firmly disapproves of this relationship, Deepak and Aarti marry. She moves in with him and his family, which includes his brother, Niranjan (Ramesh Deo), his sister-in-law, Jaswanti (Shashikala), their three children, and Deepak's father (Jagirdar). That leaves the humiliated Prakash determined to get Aarti back, whatever he may have to do. He manages to bring a discord in their marital life, so much so that Deepak asks Aarti to leave, and she returns home to her father. This is followed by Deepak having a serious accident, when Prakash is the only surgeon who can operate on him.",
    "release_date": "1962-08-03",
    "poster_path": "/nixIh7UcMZ6wyggdhpBYFHf1R6u.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-461707",
    "tmdb_id": 461707,
    "media_type": "movie",
    "title": "Haseena Parkar",
    "overview": "Haseena is very close to her brother Dawood, who turns to a life of crime and rises to power in the Mumbai underworld. After the bomb blasts of 1993, Dawood escapes to Dubai and she falls in trouble.",
    "release_date": "2017-09-22",
    "poster_path": "/wZRo2gg0jiUTvhY7upFmhBwthIz.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-232783",
    "tmdb_id": 232783,
    "media_type": "movie",
    "title": "Yudh",
    "overview": "Kidnapped at a very young age, two twin brothers are separated from there respective mother.",
    "release_date": "1985-05-03",
    "poster_path": "/ciV5vx1nl9IGMHyFUKnHOUkqCnO.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-604195",
    "tmdb_id": 604195,
    "media_type": "movie",
    "title": "The Zoya Factor",
    "overview": "An advertising agency executive Zoya Singh Solanki meets the Indian cricket team and ends up becoming their lucky charm at the 2011 Cricket World Cup.",
    "release_date": "2019-09-19",
    "poster_path": "/ytLpoqycSAhMo5W7eHJyCXn8E2n.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-76682",
    "tmdb_id": 76682,
    "media_type": "movie",
    "title": "Jab Jab Phool Khile",
    "overview": "After returning from overseas, heiress Rita is stressed out and needs to go someplace to unwind. She chooses Kashmir and, upon arrival, rents a houseboat from the owner, Raja. After a few misunderstandings, they are attracted to each other and soon fall in love. This romance is not looked upon favorably by Raj Bahadur Chunilal, Rita's dad, as he would prefer his daughter marry a suitor he has chosen for her: Kishore. Rita dislikes Kishore and will only marry Raja; the wily Raj Bahadur devises a plan that will let him keep the cake and eat it too.",
    "release_date": "1965-01-07",
    "poster_path": "/wuGkQWCal8UUHxSz9iT5v0hBBcC.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-758923",
    "tmdb_id": 758923,
    "media_type": "movie",
    "title": "Baaghi 4",
    "overview": "After waking up from a coma, a grieving man sets out to uncover the truth about his missing girlfriend.",
    "release_date": "2025-09-05",
    "poster_path": "/u2YEFW5o2Y7RAw2K4hSA4TEXF3Q.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-307814",
    "tmdb_id": 307814,
    "media_type": "movie",
    "title": "Tapasya",
    "overview": "The oldest daughter of an old and ailing man falls in love with the doctor treating her father, but the mother of the doctor insists that the girl must leave everything she does and stay with them.",
    "release_date": "1976-01-01",
    "poster_path": "/kI9daISyPCKx6EqTeLi8bLrNuZN.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-443950",
    "tmdb_id": 443950,
    "media_type": "movie",
    "title": "Gumnaam: The Mystery",
    "overview": "Mumbai-based model and aspiring actress, Ria (Mahima Chaudhary), meets with stuntman, Dev (Dino Morea), and both fall in love. Shortly thereafter, she gets an offer to act as a lead actress with renowned film-maker, Muni Gandhi, and accordingly re-locates to Shimla to start the filming. Enroute, she excitedly telephones Dev and tells him of the scenic surroundings as well as the echo of bells in a tunnel that emanate from a Hanumanji Mandir. Several days later, when he does not hear from her, he decides to travel there. But before he could do so, he does get her telephone call in which she sounds distressed and asks him to help her. When he asks about her location, she is unable to provide any, and the phone gets disconnected. The question that haunts Dev is: Where is Ria, and how is he going to assist her when he does not even know her location?",
    "release_date": "2008-12-05",
    "poster_path": "/5xWGKId5lAnhyqnghiB77lYN3wt.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-579396",
    "tmdb_id": 579396,
    "media_type": "movie",
    "title": "Karobaar",
    "overview": "Wealthy Rajiv Sinha and middle-classed Amar Saxena are two childhood friends, with similar likes, and tastes. Their similar habits lead them to being in love with the same woman - Seema, who loves Amar, and is willing to marry him no matter what. Rajiv attempts to offer money to Sapna's guardian so that he can marry her, in vain though. When Rajiv attempts to convince Amar that Sapna is being brought up by a prostitute by the name of Ratnabai, Amar is adamant, and marries Sapna, and takes her home to his brother and his family, where they are not welcomed, and asked to leave. Rajiv and Amar stop seeing each other, and regard each other as bitter enemies. Amar and Seema manage to exist, with Amar going on to become a successful prosecution attorney. Then they get the news that Rajiv has been charged with killing a young woman named Neelam Mehta. Amar is delighted for he will be given a chance to teach Rajiv a lesson, and possibly sentence him to death.",
    "release_date": "2000-09-15",
    "poster_path": "/wFSOXXrJklY2ngjIJCus9c2DfJW.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-220495",
    "tmdb_id": 220495,
    "media_type": "movie",
    "title": "Bullett Raja",
    "overview": "A common man who transforms into a gangster revolts against the very system he once obediently followed by declaring war on the police, the government, and the industrialists.",
    "release_date": "2013-11-29",
    "poster_path": "/9IkcVLgAdDvbycaOkb0t6PCIYbd.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-611359",
    "tmdb_id": 611359,
    "media_type": "movie",
    "title": "Tu Jhoothi Main Makkaar",
    "overview": "To earn extra cash, Mickey helps couples break up — but life gets complicated when he falls for Tinni, a career woman with an independent streak.",
    "release_date": "2023-03-08",
    "poster_path": "/zHLtNP4KP0GMi6p1ACf2QvVnBvI.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-101832",
    "tmdb_id": 101832,
    "media_type": "movie",
    "title": "Om",
    "overview": "Om lives in Bombay, India, in a small apartment with mother and sister. Om and his mother are of very conservative taste, when it comes to wearing clothes, however, the sister is not. This gets her in trouble, and she is raped and killed. The police register this case as that of a suicide, and produce a note purportedly written by her that blames her mom and brother for her death. Om's girlfriend, Sandali, comes to know that his sister's death was a homicide, and this sets Om off in a wild rage to find out who the killer(s) are, and why they would commit this heinous crime; and the role of the police who claim that her death was a suicide",
    "release_date": "2003-03-21",
    "poster_path": null,
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-448453",
    "tmdb_id": 448453,
    "media_type": "movie",
    "title": "Sahhas",
    "overview": "Kishinchand is a Customs Officer based in Bombay. He has been assigned to infiltrate and expose a gang of smugglers and drug dealers headed by two gangsters named Jaggan and Ajay Kumar. When Ajay's brother, Vijay, becomes a Police Informer, he is shot dead by Ajay, who not only regrets his death, but also is feeling guilty about his son taking to drugs. When his son succumbs to an overdose, Vijay starts to provide information to the police with the hope of ending all criminal activity by Jaggan and his men. He does succeed considerably, only to have his daughter, Rajni, abducted and held for ransom. Vijay agrees to testify against Jaggan only if the Police and Kishinchand locate Rajni first. The question is will Kishinchand be able to locate Rajni before Jaggan and his men kill her, and even if so, there is no guarantee that Ajay will long, especially when a brutal killer, Billa, who has never failed any assignment, has been hired to kill him at any and all costs.",
    "release_date": "1981-09-18",
    "poster_path": "/fRrUV31mZjjKoJIEpuMzGJM1Gvn.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-347839",
    "tmdb_id": 347839,
    "media_type": "movie",
    "title": "Mehbooba",
    "overview": "A singer by profession, Suraj gets stranded in resthouse in the coutnryside during a rainstorm. While there he experiences ununsual feelings, as if he has been there before. He feels himself transported to another time and era, to another birth, and drawn to a woman named Ratna. He is unable to leave this experience behind him, and decides to find out what this means. He discovers that in his past life he was a Chief Singer in the emperor's court, his name was Prakash and he had fallen in love with a courtesan named Ratna, much to the chargin and anger of his family and the emperor's and his officials. They are tragically separated. He subsequently comes across a portrait of Ratna, and shortly after he meets a gypsy, Jhumri who looks exactly like Ratna. Soon Jhumri is also able to recollect her past life, and her love for Prakash.",
    "release_date": "1976-01-01",
    "poster_path": "/68A19n8S3i9xP3FDTpdi4rc6gla.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-243831",
    "tmdb_id": 243831,
    "media_type": "movie",
    "title": "Jackpot",
    "overview": "JACKPOT THE SET UP -  Jackpot is a fast-paced thriller con, with sharp comic one-liners and crazy characters, set entirely in Goa against the backdrop of casino boats.  The film goes back and forth in time, capturing one Goan monsoon of Full Jhol. Its a card game between the players in the con. Who will come out Aces and who will end up being the Joker?  An amateur gang of young Goans plan the perfect con - no nuksaan, no pareshan. However, all good plans often  It doesn't take long for them to discover that a reverse con has been played back on them - by the very people they were trying to con.  In doing so, the five members of the gang split and start suspecting each other. After all, when there is cash in a briefcase, and a beautiful woman with a gun, things tend to go horribly wrong.",
    "release_date": "2013-12-13",
    "poster_path": "/ez2rqjHFJbiyNTWzx6STChKbIlr.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-489852",
    "tmdb_id": 489852,
    "media_type": "movie",
    "title": "Soorma",
    "overview": "Soorma, a comeback story of the hockey legend Sandeep Singh is a biopic that chronicles the life and times of the famed hockey player.",
    "release_date": "2018-07-13",
    "poster_path": "/2hmrZNlvtWdYMZ33YA4pYBcgWDF.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-69891",
    "tmdb_id": 69891,
    "media_type": "movie",
    "title": "Chillar Party",
    "overview": "A gang of innocent but feisty kids who lead carefree lives in Chandan Nagar colony, take on the big bad world of politics when one of their friend's life is endangered.",
    "release_date": "2011-07-08",
    "poster_path": "/8YiD2WbKltx1XzpWZ83sNIUttGX.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-304905",
    "tmdb_id": 304905,
    "media_type": "movie",
    "title": "Aap Beati",
    "overview": "The Kapoor family consists of Kishorilal, his wife Lajjo, son, Prakash, and daughter, Geeta. Kishorilal and Geeta toil hard to ensure that Prakash gets a good education so that he can study in America, return home, and repay the loans that the family has taken. Prakash does get to complete his studies, he also travels to America, upgrades, and returns home to be employed as Kishorilal's boss. Then Prakash gets married to Reena, who comes from a wealthy family, and moves in with them. Geeta confides in Reena that she has met a young man by the name of Ranjit, both are in love and want to get married. The entire family is overjoyed, but their joys are short-lived when Ranjit's dad, Mayadas, asks him to get married to the daughter of a wealthy man, when he refuses, he is asked to leave.",
    "release_date": "1976-10-28",
    "poster_path": "/jlbYcZD1u2MSNqQqSswpVQpT6GC.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-603673",
    "tmdb_id": 603673,
    "media_type": "movie",
    "title": "Laxmii",
    "overview": "Aasif's belief in logic and science shatters when he gets possessed by a transgender's ghost.",
    "release_date": "2020-11-09",
    "poster_path": "/6COHwokEERAjjvlmNF44Xg9BK1y.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-621003",
    "tmdb_id": 621003,
    "media_type": "movie",
    "title": "Laal Kaptaan",
    "overview": "In an 18th century setting, a Naga sadhu in India sets out on a journey across Bundelkhand to seek revenge for an injustice committed in the past.",
    "release_date": "2019-10-18",
    "poster_path": "/pwVyWygIprXq2NIgiEsD2EgDFUm.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-425932",
    "tmdb_id": 425932,
    "media_type": "movie",
    "title": "Aulad",
    "overview": "Mamta lives a poor lifestyle with her husband, Dinu, and two sons, Mohan, and Sohan. When Ram Lal, the wealthy Zamindar, Kanta Prasad Gupta's Munim, comes to them to take Sohan to Mrs. Sharda Gupta for ten days, they reluctantly permit him to do so. After 10 days, Gupta himself approaches them and begs them to let his wife keep Sohan for life. They tearfully agree. Then Mohan gets into trouble, and Dinu scolds him, only to find out that Mohan has run away from home. A search proves futile, and the couple continue to live a childless life. Now 17 years later, Mamta is seriously ill, and asks Dinu to bring Sohan back. Dinu goes to the Zamindar's house where he meets a young man who identifies himself as the real son, Suraj, and informs him that Sohan has been asked to leave. A devastated Dinu loses his memory and roams listlessly on the streets of Calcutta, unable to remember anything.",
    "release_date": "1968-09-15",
    "poster_path": "/2ATbx52m4KBclJ9MPcIV36emhmw.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-647531",
    "tmdb_id": 647531,
    "media_type": "movie",
    "title": "Yuhi Kabhi",
    "overview": "Rajoo lives alone and works in a decent company. He also has a girlfriend, who he intends to marry, that being Pooja. God suddenly appears to Rajoo one day and asks him to spread His word. Naive Rajoo does so, and this results in chaos, misunderstandings, and confusion. And as a result poor Rajoo is hauled up in Court, and the only one witness that can save Rajoo is God, but will God make an earthly appearance?",
    "release_date": "1994-01-01",
    "poster_path": "/f4gdYWDPFsFdLtpnu5suyZnhIfZ.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-302431",
    "tmdb_id": 302431,
    "media_type": "movie",
    "title": "Rang Rasiya",
    "overview": "A look a the life of 19th century Indian painter Raja Ravi Varma.",
    "release_date": "2014-11-07",
    "poster_path": "/e2ypUUowSJvGjoHAfJXtuFpvTmq.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-58051",
    "tmdb_id": 58051,
    "media_type": "movie",
    "title": "Housefull",
    "overview": "Believing himself to be a jinx and bringing bad luck upon himself and others, a man attempts to find true love, but ends up in very complicated relationships.",
    "release_date": "2010-04-30",
    "poster_path": "/koPiIQ7evC5rer6modUDxoZjYV.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-307853",
    "tmdb_id": 307853,
    "media_type": "movie",
    "title": "Atithee",
    "overview": "Navendhu Kumar lives a poor lifestyle with his handicapped father, Mohan, housewife mom, two unmarried sisters, Leela and Rajni, a younger brother, Kundan, and a sweetheart in Meena. He works for Avinash Gupta, however, when differences occur, he is framed by Gupta for breaking and entering, arrested by the police, tried in Court, and exiled from the town for a period of 12 months. After he leaves, the family is almost destitute and are exploited by Gupta. Then some months later, a young man, Anand, comes to visit them, informing them that Navendhu has sent him. He gives them some money for day to day expenses, gets some clothes for everyone, and a wheelchair for Mohan. He arranges the marriage of Rajni with her boyfriend, Ajay, despite strong opposition from Gupta, and falls in love with Leela. What the Kumar family do not know is that Anand is a fugitive on the run from the police in Bombay, and he harbors a dark secret that will change their lives forever.",
    "release_date": "1978-07-22",
    "poster_path": "/i3tlQazhbOSClLzXbkIFxjE2zC0.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-302254",
    "tmdb_id": 302254,
    "media_type": "movie",
    "title": "Raksha",
    "overview": "With India ready to enter into the Atomic Age, several international gangsters get together to steal the secret for the benefit of other nations. This results in a bomb being planted on an airliner carrying Dr. Srivastava, the Chief Scientist, and the abduction of another, Khurana. The Indian Secret Service assigns this case to Agent 116, Gopal Kishan Pandey, who is just recovering from the death of his fiancée, Asha, who was killed by gunmen hunting for him. Gopal's investigation leads him to a young cabaret dancer, Bijli, who is the main contact between the international conspirators. Through befriending her, he learns that she is not who she claims to be, but is actually the daughter of Kedar, an employee of Daulatram, who had mysteriously disappeared. As Gopal delves more and more into this mystery, the fewer become his chances at successfully apprehending an enemy that is always elusive and a step ahead of the authorities.",
    "release_date": "1982-02-05",
    "poster_path": "/9no6hG06XnjVPjV9fz3sFNf6sW0.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-769684",
    "tmdb_id": 769684,
    "media_type": "movie",
    "title": "Sazaa",
    "overview": "Kamini (Shyama) runs over a young man (Dev Anand), who is seriously injured. Kamini visits him daily even while he is unconscious. When he recovers, she is attracted to him, and sets him up with employment with her dad Seth Mothumal's (Gope) business as a manager. He dines at Mothumal's house by Kamini, where he comes across a mute maid-servant named Asha (Nimmi). Asha is attracted to him, and he also feels attracted towards her, little knowing that his past has come to re-visit him in her form, and not knowing the changes it will bring to his life.",
    "release_date": "1951-09-14",
    "poster_path": "/YwHOpr2bbkhUExOdA5a4nfxyq8.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-1389158",
    "tmdb_id": 1389158,
    "media_type": "movie",
    "title": "Maa",
    "overview": "A mother and daughter encounter a demon in a village where girls have been disappearing.",
    "release_date": "2025-06-20",
    "poster_path": "/kc5n7LJUmvBsVxzAla1ONN8kouP.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-96398",
    "tmdb_id": 96398,
    "media_type": "movie",
    "title": "Paan Singh Tomar",
    "overview": "Paan Singh Tomar goes from celebrated runner to star brigand and rebel when life after sports fails to unfold as planned.",
    "release_date": "2012-03-02",
    "poster_path": "/ii2KMVvGmcmJrqwYcT5nKn92bD5.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-1431645",
    "tmdb_id": 1431645,
    "media_type": "movie",
    "title": "Bobby Aur Rishi Ki Love Story",
    "overview": "Set against the picturesque backdrop of Cambridge, the film follows the journey of Bobby and Rishi as they going through the complexities of love and life. The story revolves around their passionate romance, which faces numerous challenges and misunderstandings. Despite being separated by circumstances, their love remains strong. Years later, fate gives them a second chance to rekindle their relationship and overcome the obstacles that once tore them apart.",
    "release_date": "2025-02-11",
    "poster_path": "/96dyu4Wc3luLC9iRwpz5pqha0Uy.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-609729",
    "tmdb_id": 609729,
    "media_type": "movie",
    "title": "Rani and Lalpari",
    "overview": "Rani is a child who is being brought up by her mother, Kamla (Asha Parekh) as her dad Rajendra (Rajendra Kumar) has gone out of town on business. Both mother and daughter live with their cruel and selfish relatives (Satyendra Kapoor and Lalita Kumari). They live with her abusive uncle. One day, Kamla gets the news that her husband is returning, and she is overjoyed. This joy turns to sorrow when she finds out that he has died in an accident. Shortly thereafter, she too passes away, leaving poor Rani at the hands of the cruel relatives. Her best friend Pappu (Master Abbas) tells her about Lalpari (Reena Roy). She succeeds to reach heaven with the help of Lalpari and manages to trick Yamraj (God of truth and death). However, Rani's father was only injured in the plane crash. Rani lives happily ever after with her parents. This movie also features the story of Cinderella and Gulliver's Travels in two songs.",
    "release_date": "1975-01-01",
    "poster_path": "/sMxZk53g3B4RSsbF0OWVISvG4dP.jpg",
    "original_language": "hi",
    "categories": [
      "bollywood"
    ]
  },
  {
    "id": "m-1062722",
    "tmdb_id": 1062722,
    "media_type": "movie",
    "title": "Frankenstein",
    "overview": "Dr. Victor Frankenstein, a brilliant but egotistical scientist, brings a creature to life in a monstrous experiment that ultimately leads to the undoing of both the creator and his tragic creation.",
    "release_date": "2025-10-17",
    "poster_path": "/jJ8AiqKKiZWZaiYMyhlF0FNH4xJ.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1197137",
    "tmdb_id": 1197137,
    "media_type": "movie",
    "title": "Black Phone 2",
    "overview": "Four years after escaping The Grabber, Finney Blake is struggling with his life after captivity. When his sister Gwen begins receiving calls in her dreams from the black phone and seeing disturbing visions of three boys being stalked at a winter camp, the siblings become determined to solve the mystery and confront a killer who has grown more powerful in death and more significant to them than either could imagine.",
    "release_date": "2025-10-15",
    "poster_path": "/xUWUODKPIilQoFUzjHM6wKJkP3Y.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1242898",
    "tmdb_id": 1242898,
    "media_type": "movie",
    "title": "Predator: Badlands",
    "overview": "Cast out from his clan, a young Predator finds an unlikely ally in a damaged android and embarks on a treacherous journey in search of the ultimate adversary.",
    "release_date": "2025-11-05",
    "poster_path": "/sMybEeAn3aFXsIUUcWPSFXlS6qS.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1096563",
    "tmdb_id": 1096563,
    "media_type": "movie",
    "title": "End of Loyalty",
    "overview": "When the head of a notorious crime family is murdered, his son Grant is hell bent on payback and the only person that can stop him from tearing the city apart and destroying himself in the process is his best friend and federal agent, Ray Rose.",
    "release_date": "2023-03-07",
    "poster_path": "/c4QA1rFQcyBZKaOOdUrDeL1G9Er.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1161617",
    "tmdb_id": 1161617,
    "media_type": "movie",
    "title": "Code 3",
    "overview": "A burned-out paramedic tries to survive his last 24 hours on the job while training a new recruit.",
    "release_date": "2025-09-12",
    "poster_path": "/gIAYMDb5mIAeCAj76q1sRsKjkzo.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-755898",
    "tmdb_id": 755898,
    "media_type": "movie",
    "title": "War of the Worlds",
    "overview": "Will Radford is a top analyst for Homeland Security who tracks potential threats through a mass surveillance program, until one day an attack by an unknown entity leads him to question whether the government is hiding something from him... and from the rest of the world.",
    "release_date": "2025-07-29",
    "poster_path": "/yvirUYrva23IudARHn3mMGVxWqM.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-507244",
    "tmdb_id": 507244,
    "media_type": "movie",
    "title": "Afterburn",
    "overview": "Set against the backdrop of a postapocalyptic Earth whose Eastern Hemisphere was destroyed by a massive solar flare, leaving what life remains mutated from radiation and fallout. The story revolves around a group of treasure hunters who extract such objects as the Mona Lisa, the Rosetta Stone and the Crown Jewels while facing rival hunters, mutants and pirates.",
    "release_date": "2025-08-20",
    "poster_path": "/xR0IhVBjbNU34b8erhJCgRbjXo3.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1511789",
    "tmdb_id": 1511789,
    "media_type": "movie",
    "title": "Captain Hook: The Cursed Tides",
    "overview": "In the aftermath of a devastating defeat by his archnemesis Admiral Smee, Captain Hook finds refuge in the coastal town of Eldritch Landing.",
    "release_date": "2025-07-11",
    "poster_path": "/bcP7FtskwsNp1ikpMQJzDPjofP5.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-617126",
    "tmdb_id": 617126,
    "media_type": "movie",
    "title": "The Fantastic 4: First Steps",
    "overview": "Against the vibrant backdrop of a 1960s-inspired, retro-futuristic world, Marvel's First Family is forced to balance their roles as heroes with the strength of their family bond, while defending Earth from a ravenous space god called Galactus and his enigmatic Herald, Silver Surfer.",
    "release_date": "2025-07-23",
    "poster_path": "/cm8TNGBGG0aBfWj0LgrESHv8tir.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-7451",
    "tmdb_id": 7451,
    "media_type": "movie",
    "title": "xXx",
    "overview": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi.",
    "release_date": "2002-08-09",
    "poster_path": "/xeEw3eLeSFmJgXZzmF2Efww0q3s.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1305717",
    "tmdb_id": 1305717,
    "media_type": "movie",
    "title": "Hunting Grounds",
    "overview": "Desperate to find refuge for her children, Chloe Marvino runs away from her Mafia tied husband, and finds shelter in a cabin with a recluse drifter named Jake. But as her husband's henchmen draw closer to her, it turns out that Jake is the biggest enemy of them all.",
    "release_date": "2025-05-16",
    "poster_path": "/cgZjpqRQt9sk6XMCwZ3B1NPAaoy.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1280450",
    "tmdb_id": 1280450,
    "media_type": "movie",
    "title": "Stolen Girl",
    "overview": "In 1993, Maureen’s six-year-old daughter Amina is snuck out of the country by her ex-husband, Karim. After years of unsuccessful attempts to find her, Maureen intersects with a professional retriever of internationally abducted children who promises to help her find Amina in exchange for her collaboration.",
    "release_date": "2025-09-04",
    "poster_path": "/fZlNXEHZsBp7unqw009MeBbMv87.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-803796",
    "tmdb_id": 803796,
    "media_type": "movie",
    "title": "KPop Demon Hunters",
    "overview": "When K-pop superstars Rumi, Mira and Zoey aren't selling out stadiums, they're using their secret powers to protect their fans from supernatural threats.",
    "release_date": "2025-06-20",
    "poster_path": "/zT7Lhw3BhJbMkRqm9Zlx2YGMsY0.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1038392",
    "tmdb_id": 1038392,
    "media_type": "movie",
    "title": "The Conjuring: Last Rites",
    "overview": "Paranormal investigators Ed and Lorraine Warren take on one last terrifying case involving mysterious entities they must confront.",
    "release_date": "2025-09-03",
    "poster_path": "/7JzOmJ1fIU43I3gLHYsY8UzNzjG.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1571470",
    "tmdb_id": 1571470,
    "media_type": "movie",
    "title": "The Rats: A Witcher Tale",
    "overview": "To pull off a daring heist, a gang of six misfit outlaws will have to do something they've never done before: trust each other — and a washed-up Witcher.",
    "release_date": "2025-10-29",
    "poster_path": "/1T0kO1cgR430AC9I6jurMOezKwg.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-338969",
    "tmdb_id": 338969,
    "media_type": "movie",
    "title": "The Toxic Avenger Unrated",
    "overview": "When a downtrodden janitor, Winston Gooze, is exposed to a catastrophic toxic accident, he’s transformed into a new kind of hero: The Toxic Avenger. Now, Toxie must rise from outcast to savior, taking on ruthless corporate overlords and corrupt forces who threaten his son, his friends, and his community.",
    "release_date": "2025-08-28",
    "poster_path": "/sIonGSpGNtH72OzbJllPOEMNjVU.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1257009",
    "tmdb_id": 1257009,
    "media_type": "movie",
    "title": "Primitive War",
    "overview": "During the Vietnam War, a recon unit ventures to an isolated jungle valley to uncover the fate of a missing platoon. They soon find themselves in a fight for their lives against an unexpected enemy — prehistoric dinosaurs.",
    "release_date": "2025-08-21",
    "poster_path": "/nWBqU5YXmDVJWWEDJ4u3ZSseNVL.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-354912",
    "tmdb_id": 354912,
    "media_type": "movie",
    "title": "Coco",
    "overview": "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
    "release_date": "2017-10-27",
    "poster_path": "/6Ryitt95xrO8KXuqRGm1fUuNwqF.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1519168",
    "tmdb_id": 1519168,
    "media_type": "movie",
    "title": "The Jester 2",
    "overview": "When teen magician Max crosses paths with the sinister Jester on Halloween night, she must outsmart a supernatural killer whose magic is all too real and whose tricks always end up in blood.",
    "release_date": "2025-09-15",
    "poster_path": "/47dsw1jSOV0Be5zmy7CtLhYpqU.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1114967",
    "tmdb_id": 1114967,
    "media_type": "movie",
    "title": "Good Fortune",
    "overview": "A well-meaning but rather inept angel named Gabriel meddles in the lives of a struggling gig worker and a wealthy capitalist.",
    "release_date": "2025-10-14",
    "poster_path": "/r83HIGA0mUiy7I9qVr17pF7SCDP.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1086910",
    "tmdb_id": 1086910,
    "media_type": "movie",
    "title": "The Lost Princess",
    "overview": "After an Ayahuasca vision transports him to a haunted castle, Alec meets Hanna who tales him the story of her mother's forced marriage and how the forbidden passion with her father was in danger when the princess pregnancy became obvious",
    "release_date": "2025-10-16",
    "poster_path": "/31S2ISsDtbnxb0kuXZl1SxSMD0K.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1234821",
    "tmdb_id": 1234821,
    "media_type": "movie",
    "title": "Jurassic World Rebirth",
    "overview": "Five years after the events of Jurassic World Dominion, covert operations expert Zora Bennett is contracted to lead a skilled team on a top-secret mission to secure genetic material from the world's three most massive dinosaurs. When Zora's operation intersects with a civilian family whose boating expedition was capsized, they all find themselves stranded on an island where they come face-to-face with a sinister, shocking discovery that's been hidden from the world for decades.",
    "release_date": "2025-07-01",
    "poster_path": "/1RICxzeoNCAO5NpcRMIgg1XT6fm.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-575265",
    "tmdb_id": 575265,
    "media_type": "movie",
    "title": "Mission: Impossible - The Final Reckoning",
    "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
    "release_date": "2025-05-17",
    "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1061474",
    "tmdb_id": 1061474,
    "media_type": "movie",
    "title": "Superman",
    "overview": "Superman, a journalist in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.",
    "release_date": "2025-07-09",
    "poster_path": "/wPLysNDLffQLOVebZQCbXJEv6E6.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-604079",
    "tmdb_id": 604079,
    "media_type": "movie",
    "title": "The Long Walk",
    "overview": "In a dystopian, alternate-America ruled by a totalitarian regime, 50 teenage boys take part in a deadly annual walking contest, forced to maintain a minimum pace or be executed, until only one survivor remains.",
    "release_date": "2025-09-10",
    "poster_path": "/wobVTa99eW0ht6c1rNNzLkazPtR.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1078605",
    "tmdb_id": 1078605,
    "media_type": "movie",
    "title": "Weapons",
    "overview": "When all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance.",
    "release_date": "2025-08-04",
    "poster_path": "/cpf7vsRZ0MYRQcnLWteD5jK9ymT.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-760329",
    "tmdb_id": 760329,
    "media_type": "movie",
    "title": "The Smashing Machine",
    "overview": "In the late 1990s, up-and-coming mixed martial artist Mark Kerr aspires to become the greatest fighter in the world. However, he must also battle his opiod dependence and a volatile relationship with his girlfriend Dawn.",
    "release_date": "2025-10-01",
    "poster_path": "/mPuBDGrVIBGOymBxR6rO3iIvBSe.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-533533",
    "tmdb_id": 533533,
    "media_type": "movie",
    "title": "TRON: Ares",
    "overview": "A highly sophisticated Program called Ares is sent from the digital world into the real world on a dangerous mission, marking humankind's first encounter with A.I. beings.",
    "release_date": "2025-10-08",
    "poster_path": "/chpWmskl3aKm1aTZqUHRCtviwPy.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-873967",
    "tmdb_id": 873967,
    "media_type": "movie",
    "title": "The Devil’s Trap",
    "overview": "In the quiet nighttime corridors of a city hospital, Abigail (Nistratova) consoles her traumatized brother, Billy (Davi) who is now a paraplegic. Billy suffers from horrible nightmares in which he revisits his childhood, where we meet his alcoholic and violent father. Sharing Billy’s hospital room is a dying man, Mr. Cohen (Dern) who seems to know everything about Billy and Abigail. There’s also another horrific presence roaming in the hospital terrifying patients and staff alike.",
    "release_date": "2024-11-01",
    "poster_path": "/deq8OGRj45eX1EFYQayG5T3Prar.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1084242",
    "tmdb_id": 1084242,
    "media_type": "movie",
    "title": "Zootopia 2",
    "overview": "After cracking the biggest case in Zootopia's history, rookie cops Judy Hopps and Nick Wilde find their partnership isn't as solid as they thought when Chief Bogo orders them to join the Partners in Crisis counseling program. But it doesn't take long for their partnership to be put to the ultimate test when they find themselves on the twisting trail of a mystery tied to the arrival of a venomous snake in the animal metropolis.",
    "release_date": "2025-11-26",
    "poster_path": "/oJ7g2CifqpStmoYQyaLQgEU32qO.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-941109",
    "tmdb_id": 941109,
    "media_type": "movie",
    "title": "Play Dirty",
    "overview": "Expert thief Parker gets a shot at a major heist, but to pull it off he and his team must outsmart a South American dictator, the New York mob, and the world's richest man.",
    "release_date": "2025-09-30",
    "poster_path": "/ovZ0zq0NwRghtWI1oLaM0lWuoEw.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1290159",
    "tmdb_id": 1290159,
    "media_type": "movie",
    "title": "A House of Dynamite",
    "overview": "When a single, unattributed missile is launched at the United States, a race begins to determine who is responsible and how to respond.",
    "release_date": "2025-10-02",
    "poster_path": "/AiJ8L90ftPAwVf3SDx7Fj9IMZoy.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-911430",
    "tmdb_id": 911430,
    "media_type": "movie",
    "title": "F1",
    "overview": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
    "release_date": "2025-06-25",
    "poster_path": "/9PXZIUsSDh4alB80jheWX4fhZmy.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1169210",
    "tmdb_id": 1169210,
    "media_type": "movie",
    "title": "The Mannequin",
    "overview": "A stylist assistant investigates her sister's death in a historic LA building, only to face a vengeful ghost of a serial killer who dismembered victims decades ago. She must escape before she's next.",
    "release_date": "2025-08-24",
    "poster_path": "/oFTpB1gzS02LtrsenTWxOKbsMpM.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1327862",
    "tmdb_id": 1327862,
    "media_type": "movie",
    "title": "Regretting You",
    "overview": "Morgan Grant and her daughter Clara explore what's left behind after a devastating accident reveals a shocking betrayal and forces them to confront family secrets, redefine love, and rediscover each other.",
    "release_date": "2025-10-22",
    "poster_path": "/z4gVnxTaks3anTycwKjDmvQSuWt.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1497036",
    "tmdb_id": 1497036,
    "media_type": "movie",
    "title": "Dr. Seuss's The Sneetches",
    "overview": "An unexpected friendship forms between two young Sneetches on an island surrounded by beaches in this sweet musical special set in the world of Seuss.",
    "release_date": "2025-11-03",
    "poster_path": "/5jqpfOY6q8ltnCFEfUPY3c0bpR5.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-756999",
    "tmdb_id": 756999,
    "media_type": "movie",
    "title": "The Black Phone",
    "overview": "Finney Blake, a shy but clever 13-year-old boy, is abducted by a sadistic killer and trapped in a soundproof basement where screaming is of little use. When a disconnected phone on the wall begins to ring, Finney discovers that he can hear the voices of the killer’s previous victims. And they are dead set on making sure that what happened to them doesn’t happen to Finney.",
    "release_date": "2022-06-16",
    "poster_path": "/p9ZUzCyy9wRTDuuQexkQ78R2BgF.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1010756",
    "tmdb_id": 1010756,
    "media_type": "movie",
    "title": "The Strangers: Chapter 2",
    "overview": "When The Strangers learn that one of their victims, Maya, is still alive, they return to finish what they’ve started.",
    "release_date": "2025-09-25",
    "poster_path": "/pqADzs5SJvI2jC0DThPVMuNJcWS.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1009640",
    "tmdb_id": 1009640,
    "media_type": "movie",
    "title": "Valiant One",
    "overview": "With tensions between North and South Korea, a US helicopter crashes on the North side. The survivors must work together to protect a civilian tech specialist and find their way out without the help of US military support.",
    "release_date": "2025-01-30",
    "poster_path": "/sT8Z14RDCAd6szzxzWFAU4xcMwg.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-1328803",
    "tmdb_id": 1328803,
    "media_type": "movie",
    "title": "Prisoner of War",
    "overview": "British RAF Wing Commander James Wright is captured by the Japanese during WWII and forced to fight in brutal hand-to-hand combat. The Japanese soldiers get more than they bargained for when Wright’s years of martial arts training in Hong Kong prove him to be a formidable opponent.",
    "release_date": "2025-09-19",
    "poster_path": "/1XET89sjRm9mUuHXhGIlKTNd5uD.jpg",
    "original_language": "en",
    "categories": [
      "hollywood"
    ]
  },
  {
    "id": "m-922087",
    "tmdb_id": 922087,
    "media_type": "movie",
    "title": "Mark Antony",
    "overview": "Set in 1995, Mark, a skilled mechanic and the son of a former gangster, stumbles upon a phone that has the ability to connect with the past, tries to save his estranged mother from a grim fate. While facing his own family's legacy, Mark must navigate through dangerous consequences of altering the past, as it causes unforeseen repercussions in the present.",
    "release_date": "2023-09-15",
    "poster_path": "/3xz1lfMrFlNtZ4H8DQKvYog8ilR.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-111614",
    "tmdb_id": 111614,
    "media_type": "movie",
    "title": "Nandha",
    "overview": "Nandha returns after serving his term for killing his father. Although he killed him to save his mother, she does not forgive him. He is then taken in by Periyavar, who shelters Sri Lankan refugees.",
    "release_date": "2001-11-14",
    "poster_path": "/fl7I3LPqyMU1HjeHxxTt0bCDUHk.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-391062",
    "tmdb_id": 391062,
    "media_type": "movie",
    "title": "Joker",
    "overview": "Mannar Mannan, an ordinary villager, decides to call himself the president of the country and starts fighting against the injustices he comes across in his society. What's his agenda?",
    "release_date": "2016-08-12",
    "poster_path": "/b8SaYgpEItoqaOgd6BUdH1ZvdrA.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-527833",
    "tmdb_id": 527833,
    "media_type": "movie",
    "title": "Tamizh Padam 2",
    "overview": "A stringent cop tries all the possible ways to nab a dreaded don who poses a big threat to the society.",
    "release_date": "2018-07-12",
    "poster_path": "/muDTWWwJo3eaRefQ2uTPdo7prfW.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-373449",
    "tmdb_id": 373449,
    "media_type": "movie",
    "title": "2.0",
    "overview": "An ornithologist who commits suicide returns as fifth force to wreack vengeance on mankind for harming birds with mobile phone radiation. The only thing that is standing in his way is 2.0, the upgraded version of Chitti, the robot.",
    "release_date": "2018-11-29",
    "poster_path": "/igWtprRqAQfJWoaUkjF0rm1nA66.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-1208217",
    "tmdb_id": 1208217,
    "media_type": "movie",
    "title": "Joe",
    "overview": "Joe, who is reeling from a heartbreak by his college sweetheart Suchitra, reluctantly marries Shruthi , who isn't ready to accept him as her husband because of the ghosts from her own past.",
    "release_date": "2023-11-24",
    "poster_path": "/acPZqREZtRxXrcAG40L7Um2lJW5.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-69615",
    "tmdb_id": 69615,
    "media_type": "movie",
    "title": "Achchamundu Achchamundu",
    "overview": "Senthil Kumar (Prasanna) and Malini (Sneha) are a happily married couple in New Jersey, living life like any other born-in-India, arrived-in-the-US couple do. He submerges himself in the office and eats sambhar rice at home and she never misses a bhajan at the temple and shops at Indian stores. They have a daughter Rithika (Akshaya Dinesh), 5 years old, the apple of their lives (their car's registration number carries the name of their daughter.) They have just settled down in a new, spacious home about which Malini, understandably, has fears. The couple squabble amicably about everything from her perpetual laundry and cooking; while Senthil argues with friends about the significance of viboothi (holy ash, usually applied on forehead) and takes his family on weekend trips and birthday parties. It is a normal, happy life in the US until Robertson (John Shea) arrives, to paint the basement. Now, things are never the same at home again.",
    "release_date": "2009-07-17",
    "poster_path": "/uqnXdaZZwUKXCVJc3YkI5OMmj2e.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-607145",
    "tmdb_id": 607145,
    "media_type": "movie",
    "title": "Rocketry: The Nambi Effect",
    "overview": "The story of the great Indian rocket scientist, Shri Nambi Narayanan's life, a true patriot, who was turned into a villain in the blink of an eye after being falsely accused of treason.",
    "release_date": "2022-07-01",
    "poster_path": "/o7A1agEoXvwyyOmIbHnUhfnC34j.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-445966",
    "tmdb_id": 445966,
    "media_type": "movie",
    "title": "CID Shankar",
    "overview": "The film start had in its title sequence in which a Politician is killed by a Suicide bomber who explodes her explosive belt. C. I. D. Shankar and his assistant Raju(Thengai Srinivasan is deputed to the Nilgiris to investigate a case of mysterious murder. C. I. D. Ashokan(Pakkirisamy) also stay for the town, who pose at research of herbal, his close relation of lover's club dancer Reeta(Jayakumari). Ashokan finds all truth and he goes to Nagamalai estate, where he gives lift to a young girl who explodes her belt.Ashokan gives diary and locker key to Vithya(Sakunthala) who saves his life and admits him in the hospital. But unfortuneately ashokan was killed by the mysterious gang in hospital. Vithya gives the things to Shankar and both fall in love. Raju falls in love with actress Rama(Kumari Radha), who also stays in the same hotel. Shankar meet Reeta and asks her to help him. She gives information to his assistant Raju and later on she is killed by the same mysterious gang.",
    "release_date": "1970-04-01",
    "poster_path": "/mgKEIETw4QvdRAUvm5ZwbpuEUTc.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-262326",
    "tmdb_id": 262326,
    "media_type": "movie",
    "title": "Meenda Sorgam",
    "overview": "Nirmala (Padmini) is a poor but talented young dancer who falls in love with a rich man's son Sekar (Gemini Ganesan), but he is forced to marry a rich man's daughter Prathiba (Tambaram Lalitha). Nirmala promises to her lover that she will never dance in public. Due to various circumstances, Sekar's house is up for auction, and in order to save him, she performs in public. With the money thus earned, she saves his house, but Sekar is unaware of this. When he learns the truth, he begins searching of her, and in the meantime, Prathiba, who is now reformed, commits suicide. Sekar meets Nirmala, who is on the verge of committing suicide, and they are reunited.",
    "release_date": "1960-07-29",
    "poster_path": "/57iY3FxqkJNMxriSmrH2a6rMYRu.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-829493",
    "tmdb_id": 829493,
    "media_type": "movie",
    "title": "Anti Indian",
    "overview": "Baasha dies just few days before the assembly by-Election for Mylapore constituency while the election campaign by the political parties are in full swing. Various obstacles faced to bury the deceased are revealed.",
    "release_date": "2021-12-10",
    "poster_path": "/uC0uvvPap0iafotOJO56gxM38KI.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-20045",
    "tmdb_id": 20045,
    "media_type": "movie",
    "title": "Guru En Aalu",
    "overview": "Guru (Madhavan) wants to start a company of his own. He works for his boss Krishna (Abbas), who is a successful entrepreneur leading a happy married life. But the major problem for Krishna is his playboy nature. Guru hopes that his boss will help him set up a company so that he can also become a boss and make money. Therefore he does everything to please him.Krishna falls for a model Seema (Mamta Mohandoss). Interestingly Guru also romances Seema. But coming to know that his boss is behind the girl, he decides to give up his romance to attain his personal goals. He goes hammer and tongs ensuring that Seema gets close with Krishna. But after a sequence of events, he realises that he yearns and craves for Seema. Did he give up his love for making it big in life or go hammer and tongs to hold Seema’s hands forms the climax.",
    "release_date": "2009-04-24",
    "poster_path": "/rhip6gKJEbUW5CarcwNwJZ6ZRwU.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-78977",
    "tmdb_id": 78977,
    "media_type": "movie",
    "title": "Enga Muthalali",
    "overview": "Vijaya Ragunadhan (Vijayakanth), a kind-hearted landlord and the village grams, lives with his younger brother Balu (Raja) and his mother (Janaki). He conflicts with his uncle (R. Sundarrajan), since he sent his cousin Jayaraman (Napoleon) to jail for killing a poor farmer. Vijaya Ragunadhan and his niece Kalyani (Kasthuri) are in love since their childhood. Vijaya Ragunadhan's uncle encourages Sitharaman, Vijaya Ragunadhan's brother-in-law, to stand for their village association's election. Sitharaman and Vijaya Ragunadhan clash during the election, Sitharaman decides to arrange the marriage between his daughter Kalyani and 'Bambaram' Pandu (Vivek). At the wedding, Vijaya Ragunadhan beats Sitharaman's henchmen and gets married with Kalyani. Balu and Kaveri, Kalyani's half-sister, fall in love with each other. Soon, Balu clashes with Vijaya Ragunadhan.",
    "release_date": "1993-11-13",
    "poster_path": null,
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-1235877",
    "tmdb_id": 1235877,
    "media_type": "movie",
    "title": "Jana Nayagan",
    "overview": "",
    "release_date": "2026-01-09",
    "poster_path": "/iSPG1IB7KyP8i3gvXzkhP9cFxQi.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-262569",
    "tmdb_id": 262569,
    "media_type": "movie",
    "title": "Murattu Kaalai",
    "overview": "Kaalaiyan is a simple person and the best Jallikattu (Bullfight) player in his village. His world revolves around his four younger brothers. The antagonist is Varadharajan, a Zamindar from the neighbouring village who lives an extravagant lifestyle. His close aide is a transgender Saroja. Varadharajan's sister falls for the macho Kaalaiyan when he wins a Jallikattu. In the meantime, Bhuvana, on the run, after Varadharajan falls for her charm and tries to molest her, takes refuge in Kaalaiyan's house. However, Varadharajan decides to marry his sister to Kaalaiyan with an eye on his land. On the day of marriage, when Kaalaiyan comes to know that the bride wants to split the bond between the brothers, he calls off the marriage.",
    "release_date": "2012-06-15",
    "poster_path": "/bL6PXjs8YKMYwuUW0FVmyDFhH0B.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-318941",
    "tmdb_id": 318941,
    "media_type": "movie",
    "title": "Darling",
    "overview": "Three young people decide to commit suicide and go to a beach house to die, not realizing that a ghost haunts the place…",
    "release_date": "2015-01-15",
    "poster_path": "/teNwhp0L2iPclQcigvgi1qg5GvC.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-262550",
    "tmdb_id": 262550,
    "media_type": "movie",
    "title": "Thoondil",
    "overview": "Thoondil is a romantic drama Tamil film starring Shaam and Sandhya directed by Adhiyaman. The film tries to work on the old saying \"hell hath no fury like a woman scorned\". Divya (Divya Spandana) is an upcoming model in London who meets Sriram (Shaam) an IT guy and falls in love. They sleep together but Sriram leaves her when Divya's boss tells him to stay out of her life if he wants to see her make it big. Divya feels betrayed when she finds out but does not know that her boss is the reason behind the split. Divya does achieve her dream and becomes a top model but is on a revenge romp to wreak havoc in Sriram’s happily married life to Anjali (Sandhya). Sandhya, is a cheerful girl whose only sorrow in life is that she doesn't have a child. And when she finally has a baby after 4 years of marriage to Sriram, Divya comes into her life and takes the baby away, saying that that is her baby. What happens after that forms the climax of the movie.",
    "release_date": "2008-02-21",
    "poster_path": "/8Z3Sp3UUIz4qlc4Hy3MfkEwK2D4.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-407331",
    "tmdb_id": 407331,
    "media_type": "movie",
    "title": "Atti",
    "overview": "Bava lives in a lower middle class tenement in Triplicane, Chennai. He runs a water can business along with his friends. He also sings Gana songs in death ceremonies. During one such occasion he crosses swords with a local thug Mookuthi and gets a mobile phone while running for his life on the road. The owner of the mobile phone is the heroine and she wants it back. Bava’s repeated attempts to meet her and hand over the mobile fail due to various reasons and when he finally meets her with the mobile, he is brutally attacked by a group of goons and the mobile goes missing again.A local paid killer Radha is hired by a wealthy builder to kill Bava and snatch the phone from him. Whether Bava manages to escape the bid to kill him? What happen to the mobile phone and what is the reason behind the phone becoming a threat to his life? These questions are answered in the rest of the film.",
    "release_date": "2016-07-07",
    "poster_path": null,
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-78937",
    "tmdb_id": 78937,
    "media_type": "movie",
    "title": "Red Jasmine",
    "overview": "A remake of the Telugu film Erra Mallelu (1981), it revolves around two men starting a revolution against their village chiefs and the owner of a factory in the neighbouring village. Sathyanathan, Punyakodi and their partners are an atrocious lot. They keep suppressing the villagers and do not even allow them to get proper education due to fear of losing control over the village. On the other hand, Ranga and Tyagu are honest factory workers who lead the fight against the factory owner for the labourers' rights.",
    "release_date": "1981-08-15",
    "poster_path": "/4Z5DZcglOLxPKk65iPSCdzvy14B.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-69434",
    "tmdb_id": 69434,
    "media_type": "movie",
    "title": "Vathiyar",
    "overview": "Dorai (Arjun) is a do-gooder don. But a police force led by ACP Easwara Pandian (Prakash Raj) and his sidekick (Sathyan) are after him. However, the poor need him as he is a Good Samaritan running an orphanage. He has help from his friends (Manivannan and Vadivelu). But Dorai has a problem. His mother (Sujatha) doesn’t approve of his ways. She feels that he is just a loutish goon. There is also Anjali (Mallika Kapoor), a TV journo, who is in love with Dorai because of his dare devil ways. Dorai has a past too. He was just an honest-to-goodness school teacher, who ends up as the deathly Dorai after a fire ravages a school and kills several children. The incident forces him to take on the system of venal officials and politics. Now, Dorai’s biggest task is to nip a dark and dire politician who wants to bomb the city. The rest, as they, is all cinematic clichés.",
    "release_date": "2006-10-15",
    "poster_path": "/ORRWWcoeaS97T7HShuYYvypfUf.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-69625",
    "tmdb_id": 69625,
    "media_type": "movie",
    "title": "Saravana",
    "overview": "Saravana and Krishna are close buddies in college. Saravana sees a video tape of Krishna's sister Sadhana studying in London and falls in love with her. So to meet her, Saravana goes with Krishna to a village near Tirunelveli where he finds that there is a bloody war going on between two warring caste groups. Krishna's brother Soundarapandi his wife and Krishna are killed by the rival group of Dorai Singam. However Saravana saves Sadhana and takes her to Chennai. Initially Sadhana is not accepted by Saravana's large family but slowly when they come to know about her background they support and love her. The rest of the film is how Saravana tries to help Sadhana to go back to London, and in the process eliminates the entire gang of Dorai Singam single-handedly.",
    "release_date": "2006-02-01",
    "poster_path": "/ngH32R3Fc730M1Tf2pjiDaY3MUC.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-270770",
    "tmdb_id": 270770,
    "media_type": "movie",
    "title": "Mahabalipuram",
    "overview": "The life of Panja, an orphan and a sculptor, revolves around Sathish, Othavada, Kuppan and Sammy, all of whom reside in Mahabalipuram and are close to each other. The only other person Panja considers himself close is Durai, a politician and criminal, who saved him from death when he was a boy. Panja shows his gratitude to Durai by occasionally helping him with his anti-social activities. When Sathish chooses to marry the love of his life, Sangeetha , much against the wishes of their parents, his four friends help him do so. Life is pleasant for a while with Panja too falling in love with Mahalakshmi a college student who moves into the area. However, their lives take a tumultuous turn when the friends chance upon a sleaze video which shocks them out of their wits and results in the death of the newly wed couple. Soon, more dark deeds and disturbing developments follow...",
    "release_date": "2015-03-13",
    "poster_path": null,
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-280260",
    "tmdb_id": 280260,
    "media_type": "movie",
    "title": "Vanna Vanna Pookkal",
    "overview": "After saving Manoranjitham from committing suicide in the forest, the kindhearted Siva brings her home to live in his house, much to the despair of his neighbor Shenbagam, who secretly loves him. Things become even more complicated when Siva falls in love with his houseguest and arranges for them to be married, but on the day of the wedding, she mysteriously disappears. Is she gone for good, and why? And where does Shenbagam fit into the picture?",
    "release_date": "1992-01-14",
    "poster_path": "/7zU7DU93OIF7KEsmRsj6TWFSWlI.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-361047",
    "tmdb_id": 361047,
    "media_type": "movie",
    "title": "Udhavikku Varalaamaa",
    "overview": "Muthurasu (Karthik) has come to the city to earn money to finance his mother's (Vadivukkarasi) operation and asks for ideas from his friend Annamalai (Janagaraj). To rent a place owned by a Brahmin couple (Manivannan and Kovai Sarala), Muthurasu transforms himself into a Brahmin Pichumani and also falls in love with Mythili (Devayani), the couple's daughter. Getting a job at a company owned by a devout Muslim (Jaiganesh) makes him put on the garb of Hussein, a Muslim. Things get more complicated when an unsafe situation makes him take on the role of Pastor James, a Christian and Stella (Sangeetha), his secretary in the office where he works as Hussein, falls in love with him.",
    "release_date": "1998-01-16",
    "poster_path": null,
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-326321",
    "tmdb_id": 326321,
    "media_type": "movie",
    "title": "Gokulam",
    "overview": "Chellappa (Jayaram), an orphan, runs a photo studio in deficit with his friends (Chinni Jayanth and Vadivelu). Mary (Bhanupriya) comes to his village to learn singing to a guru (Kalyan Kumar) and she helps her guru's family in many ways. Kannan (Arjun Sarja), her guru's son, is supposed to be in the city. Chellappa falls in love with Mary and he proposes to marry her. Mary reveals that she was married and she tells him her past.  Her real name was Gayatri, she was a rich girl and she was in love with Kannan. Kannan had lot of responsibility and had to help his poor family. Gayatri's guardian (Jaishankar) accepted for their marriage but Vasanth (S. N. Vasanth), his son, also wanted to marry her and sent henchmen to kill him. Kannan died at Gayatri's birthday party where her guardian had arranged for their engagement after Gayatri promised to help his family. Vasanth's father sent his son to jail and he apologized to Gayatri. She went to her friend Mary's village instead of her.",
    "release_date": "1993-06-11",
    "poster_path": "/3qhIB6PjZw8uII5yZaiypVYbMys.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-115953",
    "tmdb_id": 115953,
    "media_type": "movie",
    "title": "Kadhalil Vizhunthen",
    "overview": "Kadhalil Vizhunthen is a movie starring Nakul and Sunaina. The movie's music was composed by Vijay Antony, cinematography by S D Vijay Milton and editing by V.T Vijayan. The movie was produced by Umapathy for Atlantic Cinemas. The shooting for the film started in August 2007 and the movie was released in September 2008.",
    "release_date": "2008-09-26",
    "poster_path": "/t0YVVam2bmaTbez1pGOmIKWopXH.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-78869",
    "tmdb_id": 78869,
    "media_type": "movie",
    "title": "Coolikkaran",
    "overview": "Raja lives with his elder brother, sister-in-law, and their little daughter.  Rajabecomes a coolie and transports articles. He is jailed for smuggling. His brother gets into an accident at work at the mill and loses his arms. He loses his job and needs money for treatment. Raja begs his brother's boss , but he refuses. Raja breaks into the boss' safe to get the money but it is too late as the brother dies. The boss throws Raja in jail. How he escapes and gets his revenge on the boss forms the climax of the movie",
    "release_date": "1987-06-05",
    "poster_path": "/6YE2I4dMXMvEgP69Mhqb4h9HzPl.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-503839",
    "tmdb_id": 503839,
    "media_type": "movie",
    "title": "Enakkoru Magan Pirappan",
    "overview": "Ranganayak, a rich women, has three sons : Gopi, Madhu and Balu. Ranganayaki wants absolutely a grandson and she will pass on her whole inheritance to her son who has a male child. The elder sons have only daughters and Balu is still bachelor. Balu is a singer in the marriage functions and he falls in love with Swathi, a girl from a middle-class family. He gets married with her and Swathi becomes pregnant. Balu's best friend, Raja, an honest journalist, is married to Shanthi and his wife is also pregnant. Swathi and Shanthi deliver the same day. Balu has a daughter although Raja has a son. In the meantime, Ranganayaki has a severe heart attack and the doctor says to not reveal shock news. In the hospital, a misunderstanding happens and Balu's father shows Raja's son to Ranganayaki in a serious condition. Ranganayaki is immediately recovered. Balu maintains the lie to save his mother's life. What transpires next forms the rest of the story.",
    "release_date": "1996-08-15",
    "poster_path": "/50EYrxtBAhjQfchnh6qxMxYkI3I.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-114900",
    "tmdb_id": 114900,
    "media_type": "movie",
    "title": "Manam Kothi Paravai",
    "overview": "Though Kannan loves Revathy, his neighbour and childhood pal, he lies to his friends that she too is in love with him. So, when Revathy's family, respected - and feared - in the village, arranges her wedding with another, his friends decide to get the lovers together at all costs and send an inebriated and unconscious Kannan and a drugged Revathy off to Kerala in the hope that her family will accept the couple once they are married. How does their plan play out?",
    "release_date": "2012-06-01",
    "poster_path": "/fT6tRx63zsozINi5usFTSTfoI4A.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-66500",
    "tmdb_id": 66500,
    "media_type": "movie",
    "title": "Bommalattam",
    "overview": "An investigation is immediately opened up into the alleged death of Trishna, who was in the car. CBI suspects Rana of committing planned murder. Here enters Vivek Varma, CBI officer who intent in nailing Rana with murder. Vivek does have his own agendas though, as his girlfriend, an ardent fan of Rana himself, has gone on to join Rana as an assistant, and has gradually grown more attached to Rana than she is to Vivek himself, causing their relationship to strain. Vivek probes continuously to try to convict Rana with murder, as he reveals that two more murders took place within his film sets during the shooting of 'Cinema', and believes now that Rana is responsible for all three murders.. He hires her as his new muse, and in the shooting spot, they are shown to share a very intimate relationship, fueling existing rumors that he is a womanizer",
    "release_date": "2008-05-05",
    "poster_path": "/kYiDhP2Lou52TjWDEYJEp5JHPJj.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-280165",
    "tmdb_id": 280165,
    "media_type": "movie",
    "title": "Thani Oruvan",
    "overview": "An idealistic cop and an ambitious scientist-businessman indulge in a high-stake battle of wits.",
    "release_date": "2015-08-28",
    "poster_path": "/90ZpZw1qZlt0RUVByJATFVUEeEm.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-502070",
    "tmdb_id": 502070,
    "media_type": "movie",
    "title": "Super Da",
    "overview": "Kathirvel comes to the city to live with his friend Subramani. While Reshma is a soft-spoken college student, her mother Gangamma is an heartless lady rowdy. Rahul, a college student, falls in love with Reshma at the first sight. Reshma also loves him but to save Rahul's life, she tries to avoid him. Finally, Reshma accepts his love. Gangamma, knowing their love affair, hurts heavily Rahul in front of Kathirvel and Subramani and they reached Rahul to the nearby hospital. Reshma insults Kathirvel for being passive during the attack and Kathirvel tells his tragic past to Reshma. In the past, Kathirvel was in love with Reshma's sister Meenakshi. They So Gangamma tried to kill Kathirvel but Meenakshi intervened and was accidentally by her mother. Before her death, Kathirvel promised Meenakshi to not kill her mother. Kathirvel is now determined to unite the lovers. What transpires later forms the crux of the story.",
    "release_date": "2004-06-25",
    "poster_path": "/3RFrLne8UTzNmrmu3yQXELrQfKe.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-503875",
    "tmdb_id": 503875,
    "media_type": "movie",
    "title": "Mayabazar",
    "overview": "Suji is the only daughter of billionaire Vishwanathan who plays unsuspecting pranks on everyone and one such prank she does by conducting an interview for choosing personal secretary for her father in which she chooses Ram as the secretary. Vishwanathan's friend Moorthy, manager and Swarna wants to takeover the whole property of Vishwanathan so Moorthy set up a person Raja to get married to Suji. However Suji gets married to Ram. Vishwanathan suddenly dies of heart attack and Suji who goes to Ooty gets killed by Ram and Moorthy. Suji becomes a ghost and decides to take revenge. Suji witnesses Mayamma, a look-alike who works a fake exorcist and asks her to act as herself. What transpires later forms the crux of the story.",
    "release_date": "1995-08-12",
    "poster_path": "/40a5i4fZh2dpc4TrWi2eJ1RQ096.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-323962",
    "tmdb_id": 323962,
    "media_type": "movie",
    "title": "Aval Oru Thodar Kathai",
    "overview": "Kavitha, a young woman, is the sole bread winner for her family. In order to fulfill their dreams and ambitions, she puts herself through the daily grind of working in an office maintaining a tough exterior at home and at office. The delays in her marriage with her lover Tilak, frustrates him but he decides to wait for her. Eventually when Kavitha consents to marriage, Tilak springs up an unpleasant surprise.",
    "release_date": "1974-11-13",
    "poster_path": "/fz7FM4ojYbtUBxGLqQ8zNKOBW3I.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-66251",
    "tmdb_id": 66251,
    "media_type": "movie",
    "title": "Uzhaippali",
    "overview": "Rajini is working as a coolie in a factory. He is asked by three brothers to act as a foreign-returned rich man the heir of a property. Rajini acts but always escapes as he doesn't want to face consequences. But then he comes to know that he is the heir to the property, his father was killed by three brothers to take away the property and mother  became a mental patient. He avenges the death of his father by killing the villains. At last, he says he doesn't want to be an heir to money and always remains as a coolie.",
    "release_date": "1993-06-24",
    "poster_path": "/uXyxTAkg7Z9wFRvHbR9IyLB5FCV.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-503620",
    "tmdb_id": 503620,
    "media_type": "movie",
    "title": "Thaali Pudhusu",
    "overview": "Arun falls in love at first sight with a bank cashier Seetha and follow her everywhere. Seetha refuses his love and tells him her past. In the past, Seetha was from a middle-class family. Seetha's brother-in-law was a jobless, and lived with them. Balu was a bank manager and falls in love with Seetha. Mani, Balu's father, a miser, looked for a rich daughter-in-law. Finally, Balu got married with Seetha and the same day, Balu died in a crossfire. So Mani refused to keep Seetha in his house. Later, without money, Mani begged Seetha to come with him and she took her late husband job. Seetha's brother-in-law took his wife's thaali and tied the thaali to Seetha. She immediately removed the thaali. Arun decides to marry her despite her past. The court cancels the marriage between Seetha and her brother-in-law. Seetha's sister kills her husband to save Seetha's marriage. At the end, Arun and Seetha get married.",
    "release_date": "1997-04-10",
    "poster_path": "/jed9VL9F5OyyYWol3L3xqAdo0ZE.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-326325",
    "tmdb_id": 326325,
    "media_type": "movie",
    "title": "Karnaa",
    "overview": "Vijay, a carefree and frolicsome youth, is sent by his father Deenadayalan in Ooty to work and becoming a responsible businessman. There, he falls in love with the college student Anjali. Her brothers are dangerous criminals and they are against their love because Vijay's father is a police officer. Thereafter, Devaraj is sent to jail so his brother appoints the lawyer Karnaa who is disabled and a sensitive person.  Later, Karnaa falls in love with the school teacher Amudha, after few quarrels between both. One day, Deenadayalan saw Karnaa at the court who looks like his son Vijay. In the past, he had twin boys, but abandoned one of the twin baby because he was disabled. Karnaa is upset when he knew the truth and is now determined to win the case in front of his father.",
    "release_date": "1995-04-14",
    "poster_path": "/25UGqYl4AvjfJxHVWR0kLTL0mlz.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-1432631",
    "tmdb_id": 1432631,
    "media_type": "movie",
    "title": "Idhayam Murali",
    "overview": "",
    "release_date": "2025-06-27",
    "poster_path": "/iZzR7fYiJ3bGew8liRPxipPDEfj.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-78641",
    "tmdb_id": 78641,
    "media_type": "movie",
    "title": "Kola Kolaya Mundhirika",
    "overview": "Kola Kolaya Mundhirika film is about wealthy man delegates a trusted subordinate to hide priceless diamonds in a set of chairs before he is murdered by a trio of criminals out to get their hands on the same.Twenty years later, the hunt for the chair resurfaces as the trusted subordinate reveals partial information about the treasure to the protagonist, Krish (Karthik Kumar). Realizing that he needs a little help, Krish enlists the help of his thieving rival, Veni (Shikha). The villainous trio, also privy to this information, follow Krish and Veni as they set out to...",
    "release_date": "2010-05-21",
    "poster_path": "/ZSLgSo7AOhw3MarWBvBKBjCcc9.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-69670",
    "tmdb_id": 69670,
    "media_type": "movie",
    "title": "Majaa",
    "overview": "Govindan (Manivannan) is a thief who has two children. Aadhi (Pasupathy) and Mathi ('Chiyaan' Vikram). Years go by and the two, Aadhi and Madhi, decide to stop stealing and mend their ways and lead a hardworking life along with their father. They migrate to neighboring village and meet a retired agricultural officer, Chidambaram (Vijaya Kumar) who is in deep debts and is under pressure from the village's landlord, Kalingarayar (Murali) to clear his debts. In efforts to help Chidambaran, Mathi confronts Seetha Lakshmi (Asin), Kalingarayar's daughter, who comes to collect the money Chidambaram owes her father. Seetha Lakshmi starts to acquire a liking for Mathi but keeps it hidden due to her father's atrocious temper. In an attempt to teach Kalingarayar a lesson, Mathi forcibly ties the mangalsutram around Seetha's neck. Kalingarayar, realizing his daughter's love for Mathi...",
    "release_date": "2005-11-02",
    "poster_path": "/Aw9K3Z3lVypmv6wWqtJdg8Gqe4X.jpg",
    "original_language": "ta",
    "categories": [
      "tamil"
    ]
  },
  {
    "id": "m-1403735",
    "tmdb_id": 1403735,
    "media_type": "movie",
    "title": "Laila",
    "overview": "Sonu Model, a renowned beautician from the old city, is forced to disguise himself as Laila, leading to a series of comedic, romantic, and action-packed events. Chaos ensues in this hilarious laugh riot",
    "release_date": "2025-02-14",
    "poster_path": "/aFogllaRGlAhk1nqvVGFpZpl4qU.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-78581",
    "tmdb_id": 78581,
    "media_type": "movie",
    "title": "Anthuleni Katha",
    "overview": "Saritha sacrifices her comforts and the prospect of a life with her boyfriend for the sake of her family. Things take a turn when her boss proposes to marry her.",
    "release_date": "1976-02-27",
    "poster_path": "/huuC2o0kvmTi1oRIOYfDTcyTXbI.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-1511417",
    "tmdb_id": 1511417,
    "media_type": "movie",
    "title": "Bāhubali: The Epic",
    "overview": "When a mysterious child is found by a tribal couple near a roaring waterfall, they raise him as their own. As he grows, Sivudu is drawn to the world beyond the cliffs, where he discovers the ancient kingdom of Mahishmati, ruled by a cruel tyrant, haunted by rebellion, and bound to his past. What begins as a quest for love soon unravels a legacy of betrayal, sacrifice, and a forgotten prince.",
    "release_date": "2025-10-29",
    "poster_path": "/4sLSorDKKDN944kWngxgQlpdDeg.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-811941",
    "tmdb_id": 811941,
    "media_type": "movie",
    "title": "Devara: Part 1",
    "overview": "Devara, a fearless man from a coastal region, embarks on a perilous journey into the treacherous world of the sea to safeguard the lives of his people. Unbeknownst to him, his brother Bhaira is plotting a conspiracy against him. As events unfold, Devara passes on his legacy to his mild-mannered and timid son, Varada.",
    "release_date": "2024-09-26",
    "poster_path": "/lQfuaXjANoTsdx5iS0gCXlK9D2L.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-579974",
    "tmdb_id": 579974,
    "media_type": "movie",
    "title": "RRR",
    "overview": "A fictional history of two legendary revolutionaries' journey away from home before they began fighting for their country in the 1920s.",
    "release_date": "2022-03-24",
    "poster_path": "/u0XUBNQWlOvrh0Gd97ARGpIkL0.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-301668",
    "tmdb_id": 301668,
    "media_type": "movie",
    "title": "Rowdy Fellow",
    "overview": "An egoistic wealthy man becomes a cop to settle a score, but gets into a feud with a local politician.",
    "release_date": "2014-11-21",
    "poster_path": "/pwQ6rpk4eGDU9Vgs8Xb6b2wesYk.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-360133",
    "tmdb_id": 360133,
    "media_type": "movie",
    "title": "James Bond",
    "overview": "Nani is a trepid and fearful guy who works as a software engineer. Bullet is a mafia don in Dubai. Her mother doesn't know about Bullet's profession. Bullet is forced to come back to India when her mother falls ill. Her mother's last wish is to get Bullet married. That's when Nani falls in love at first sight with Bullet when she visits a temple wearing a traditional dress. Rest of the story is all about what happens when a coward like Nani marries a gangster girl without knowing her real profession.",
    "release_date": "2015-07-24",
    "poster_path": "/lQTdCg0BujgmnNno51BHgHx063Z.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-1505644",
    "tmdb_id": 1505644,
    "media_type": "movie",
    "title": "ENE Repeat",
    "overview": "Sequel of Ee Nagaraniki Emaindi (2018)",
    "release_date": "",
    "poster_path": "/2bqTVbUOVHUYLVbFoxB6UmkW0TM.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-303054",
    "tmdb_id": 303054,
    "media_type": "movie",
    "title": "Desa Drohulu",
    "overview": "Sri Varada Sri Krishna Yachendra, Zamindar of Mangalapuram writes in his will that his jewelry will be given to the temple. Bhadrachalam temple trustee Dharma Rao, while taking the jewelry, met with an accident and the jewelry disappears. Twenty years roll by, Prabhakar Rao, who was an inspector at the time of the crime, is now police commissioner. Diwan Raja Bhushnam becomes a big industrialist. Trustee Dharma Rao had two sons, Raja Rao and Gopal Rao. Gopal Rao mysteriously meets Radha, daughter of Prabhakar Rao and they fall in love. At a party, Raja Rao behaves against Raja Bhushnam and he is sent to jail. Gopal Rao wants to find out the reason for the injustice done to his brother Raja Rao. He meets Raja Bhushnam and he says that his father had stolen jewelry belonging to the temple and committed suicide. To know the truth, Gopal Rao goes to the commissioner. The rest of the story is how Gopal Rao catches the real culprits and proves his father's innocence.",
    "release_date": "1973-03-29",
    "poster_path": "/3VEMF5BjtY5sb2GvdIQEkKkd21o.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-315627",
    "tmdb_id": 315627,
    "media_type": "movie",
    "title": "Sudigundalu",
    "overview": "Judge Chandrasekharam is very kind and helpful to the relatives of the culprits. His wife dies after giving birth to a baby boy. His son Raja was killed by two youth (Prasanna Rani and Vijayachander). The judge who now wears the pleader's shoes argues in the favour of the young culprits and shocks the whole audience on bringing out the real intentions of the murder. Sudigundalu (English:Whirlpools): is a 1968 Telugu, drama film directed by Adurthi Subba Rao. The film has garnered the National Film Award for Best Feature Film in Telugu. The film marked the debut of Nagarjuna Akkineni in a cameo.",
    "release_date": "1968-01-01",
    "poster_path": null,
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-410143",
    "tmdb_id": 410143,
    "media_type": "movie",
    "title": "Thanu Nenu",
    "overview": "Kiran(Santosh Shobhan) is a call center employee who hates America and NRI culture. One fine day, he comes across Keerthi(Avika Gor) and falls in love with her. As time passes by, even Keerthi approves his love and the couple spend some happy times together.  On the other hand, Keerthi’s father(Ravi Babu) is a shrewd man who only dreams of sending his daughter to the US for big bucks. Twist in the tale arises when he decides to get his daughter married to an NRI.  What will Kiran do now ? How will he stop Keerthi from leaving to the US ? Why does Kiran hate America ?",
    "release_date": "2015-11-27",
    "poster_path": null,
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-87619",
    "tmdb_id": 87619,
    "media_type": "movie",
    "title": "Vijayendra Varma",
    "overview": "An un-named man (Bala Krishna) lives with his wife (Laya), daughter and in-laws. He does not have a name nor does he know who he is. He cannot remember anything that has happened 7 years before. However, he realizes that he possesses special combat skills whenever he comes across evil elements. When he forces his wife to tell the truth, she reveals that he was found in river in a mutilated state and he was taken care of by her. As the man goes to Hyderabad searching for his identity, a few incidents lead to the answer. He discovers that he is none other than the most respected and committed Indian Army Officer, Vijayendra Varma. The rest of the story is about how he retraces his past and saves the nation from Pakistani Jihadis.",
    "release_date": "2004-12-04",
    "poster_path": "/xOiCG5NRNeTXpvtslIYsmGDZTEK.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-82201",
    "tmdb_id": 82201,
    "media_type": "movie",
    "title": "Nuvvila",
    "overview": "Nuvvila is the story that revolves around three guys and girls on same age. We will get introduced to three characters and three girls with having their respective problems.  Anand (Ajay) who is a graduate thinks about doing job or to continue studies further. In this dilemma, he will be idle for one year and mean while, he falls for his neighbor archana (yami). Everything goes well for him until he came to know that archana is in love with a cricketer Vishnu.  And the next guy Mahesh (Hayish) dream of becoming an aspiring model. He faces several problems in his way to accomplish his dream.  Coming to the third character Raja (Prasad) is a guy who wants to become a musician. He always thinks his classmate Rani as sign of bad luck for him. But to the funny, he marries that girl in an unavoidable situation.  Whether these three guys achieved their dreams forms the final crux….",
    "release_date": "2011-11-03",
    "poster_path": "/tfK0rKOKaqKGwFOJ7oihD3vizEm.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-401402",
    "tmdb_id": 401402,
    "media_type": "movie",
    "title": "Vinodham",
    "overview": "Four unemployed orphans who are adventurous and fun-loving, with a care-free attitude and absolutely no worries, and the lead of them, Raja (Srikant) falls in love with another fun-loving girl, Ashta Lakshmi (Ravali). But, the only problem in their way to marriage is Ashta Lakshmi's father, Bangaram (Kota Srinivas Rao), who although loves his only daughter, but does not want his daughter's marriage with this poor guy to happen. He instead wants richest possible groom because he believes money is the only source of happiness and comfort. How Raja and his friends try out many ways to convince Bangaram is the hilarious turn of events that is to be seen.",
    "release_date": "1996-08-02",
    "poster_path": "/5bY1oLmZWhLVZX9BLlDNKYYhD01.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-77038",
    "tmdb_id": 77038,
    "media_type": "movie",
    "title": "Manasantha Nuvve",
    "overview": "Anu (Baby Zeeba) and Chanti (Master Anand Vardhan) are childhood friends at Araku Valley. Anu is a daughter of a wealthy government official and Chanti is the son of a poor widow. Anu leaves Chanti at the age of 8 when her parents shift to Vizag. Later on Chanti loses his mother. Mohan Rao (Chandra Mohan) gets hold of Chanti renames him as Venu and adapts him. Anu (Reema Sen) and Venu (Uday Kiran) grows up at their respective places. Anu finishes her higher studies in Malaysia and returns. Venu does also single-mindedly waits for Anu. Anu starts writing a serial named 'Manasanta Nuvve', which contains her live story, in Swaty magazine hoping that Chanti would read it comes back to her. But she keeps her pen name as Renu, so that her anonymity could be protected (in the serial the heroine's name is Anu and hero's name is Chanti).",
    "release_date": "2001-10-19",
    "poster_path": "/wE722SEtN66thnGkeFIGOq1MSWB.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-803501",
    "tmdb_id": 803501,
    "media_type": "movie",
    "title": "Edadugula Bandham",
    "overview": "A jealous husband who begins to doubt the fidelity of his wife, when his best friend enters their lives. Wife was unable to convince husband that she loves only him. He leaves her, not knowing that she is pregnant with his child. Depressed and confused, husband becomes a homeless wanderer, while wife remarries to provide a secure home for her child. Many years later, the truth dawns on him as he turns up, a broken man, at his own daughter's wedding.",
    "release_date": "1985-11-22",
    "poster_path": "/ngTPsqun4uoGxWjy6nhuZStiVqF.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-267115",
    "tmdb_id": 267115,
    "media_type": "movie",
    "title": "Choodalani Vundi",
    "overview": "Ramakrishna (Chiranjeevi) is a mechanic whose life changes when he meets Priya (Anjala Zaveri) at a train station. She sees him and feels some inexplicable connection and runs away with him to flee her father, Mahendra's (Prakash Raj) goons. They end up living in the forest with their son, but her father, who is an underworld don, kidnaps her so that he can marry her off to another don's son. Ramakrishna confronts her father and in the ensueing struggle Priya takes the bullet shot at her husband and dies. Their son, because of the shock, loses his voice and Ramakrishna is jailed. Mahendra takes the boy away to Kolkata, where the story originally started. Rama Krishna with the help of Padmavathi (Soundarya) reunites with his son.",
    "release_date": "1998-09-11",
    "poster_path": "/eps7UYs7gry5HCP6qCFsOUjC38Z.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-260016",
    "tmdb_id": 260016,
    "media_type": "movie",
    "title": "Sivamani",
    "overview": "Shivamani (Nagarjuna) is a honest cop in Vizag. He falls in love with Vasantha (Asin), a beautiful lady who aspires to become a singer. There is a mafia guy called Dutt (Prakash Raj), whom Shivamani troubles a lot. Incidentally Vasantha is distantly related to Dutt and both of them belongs to Kerala. In the meantime, Shivamani's mother (Sangeeta) gets paralyzed. Shivamani and Vasantha take her to Kerala to get the treatment of Kerala's Ayurveda specialists. In the process, Dutt gets back to Kerala and he is on the mission to weaken Shivamani by getting Vasantha away from him. The rest of the story is all about how he gets back Vasantha with the help of a newspaper's editor Pallavi (Rakshita).",
    "release_date": "2003-10-23",
    "poster_path": "/l5jbtj9ZHgXDC7TMav4xBthqyu3.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-23932",
    "tmdb_id": 23932,
    "media_type": "movie",
    "title": "143 (and I Miss You)",
    "overview": "Siddu (Sairam Shankar) is a carefree boy-next-door. Sanjana (Samiksha) is a doting sister of four elder brothers. Siddu is like a family member in Sanjana's household. One fine day, Sanjana elopes with Siddu. And fate separates them. Sanjana goes into the protective hands of naxalites. Siddu lands up in the house of a journalist (Flora Saini). Siddu thinks Sanjana is dead. Sanjana thinks Siddu is no more. The rest of the story is all about how fate unites them again.",
    "release_date": "2004-08-27",
    "poster_path": null,
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-85952",
    "tmdb_id": 85952,
    "media_type": "movie",
    "title": "Madatha Kaaja",
    "overview": "An average tale, the story begins at Vizag and here lives Kalyan (Allari Naresh) who works as a police informer and ensures crime is zero in his area. His life takes a turn when he sees Swapna (Sneha) and falls in love with her. With some tricks he manages to woo her and finally gets her love. The story takes a turn when Kalyan is given an assignment by the police to expose the illegal dealings of two dons KP and JP (Jayaprakash reddy, Ahuti prasad) along with their big boss in Bangkok Nanda (Ashish Vidyarthi). To add to it, Swapna is the daughter of JP and her marriage is fixed to KP's son (Subbaraju). What happens from there forms the rest of the story.",
    "release_date": "2011-09-30",
    "poster_path": null,
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-695925",
    "tmdb_id": 695925,
    "media_type": "movie",
    "title": "Bharyabhartala Bandham",
    "overview": "Sanjeevi (Akkineni Nageswara Rao) and Archana (Jayasudha), a divorced couple meet just because of Sanjeevi's shares in Archana's company. This couple has a daughter called Krishna (Rajani), who lives with her mother without any freedom. Radha (Nandamuri Balakrishna) is Sanjeevi's sister's son, Sanjeevi, knowing that Archana is trying to get their daughter married to an Indian settled in America, tries to conduct Radha and Krishna's wedding. Will that wedding unite Sanjeevi and Archana?",
    "release_date": "1985-03-28",
    "poster_path": "/xg2cPEAAoUrmLMfxvFLxtJwneAP.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-281942",
    "tmdb_id": 281942,
    "media_type": "movie",
    "title": "Viyyalavari Kayyalu",
    "overview": "Viyyalavari Kayyalu is a 2007 Telugu film starring Uday Kiran and Neha Jhulka. E.Satti Babu directed this movie. L. Sreedhar, produced it under their banner Larsco Entertainments of Ramalakshmi Creations. It was released on 1 November 2007.  Vamshi (Uday Kiran) is a hair stylist who falls in love with Nandini (Neha Jhulka), sister of Bhoopathi Rayudu (Sri Hari), a good hearted factionist. Vamshi and Nandini decides to get married only with the consent of their elders. So Vamshi comes to Juturu, a village in Rayalaseema to convince Bhoopati Rayudu of his love with the latters sister. Initially Bhoopati doesn't like Vamshi and everyone laughs at Vamshi when he says that he is a hair stylist in city. But the pair believes that true love never runs away but stands brave even after initially being rejected. Bhoopati values the word given by any of his family members and stands by it.",
    "release_date": "2007-11-01",
    "poster_path": "/8AagjwDBDEBip79kqBBA86ipxa7.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-410652",
    "tmdb_id": 410652,
    "media_type": "movie",
    "title": "Ninne Ishtapaddanu",
    "overview": "Hero Charan (Tarun) a middle class family guy, is cheated by Sanjana (Anitha), a girl from rich family. This is to take revenge on him as he teased her in the past. When the hero comes to see Sanjana after a gap of few months, realizes that she is engaged to an NRI (Rajeev Kanakala), who is an innocent guy and loves to marry a girl with Indian culture. Charan comes to know that the bridegroom happens to be his friend. Then Charan tries to change the egoistic nature of Sanjana from a different angle. Meanwhile, the hero gets a friend Geethanjali (Sridevi), an orphan girl, working in All India Radio and gets attracted by the hero.",
    "release_date": "2003-06-13",
    "poster_path": "/qgkTSeIMTax6yAKvh6atTDa2PZv.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-800595",
    "tmdb_id": 800595,
    "media_type": "movie",
    "title": "Jai Sena",
    "overview": "Four agricultural engineering students wanted to help the farmers with the latest techniques in farming. They approach the concerned Minister for this, but the Minister didn’t support their ideologies and sends them out. The youngsters decided to loot the Minister’s bank balance to use it for the agricultural project. As per their plans, they loot his money from Bank, which is unaccounted for. Devadas, a tough cop, deals with the case. How do the students escape? Were they able to serve the farmers? The answers form the rest of the story.",
    "release_date": "2021-01-29",
    "poster_path": "/wVlYUz6qx97CbdPcOoaeONOSaKV.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-371630",
    "tmdb_id": 371630,
    "media_type": "movie",
    "title": "Bava Bava Panneeru",
    "overview": "Kota Srinivasa Rao is a wealthy man, with poor relatives waiting for him to die so that they can get their hands on his money. Kota wants to get married so that he can leave his health to an heir. However his relatives hamper all his efforts to get married. He decides to evade them by leaving his home and moving to another place. He also adopts a young girl Chandraprabha (Rupa Kala), with the intention of marrying her when she grows up. He installs her in a home with 2 servants as caretakers. Ramesh (Naresh) is under pressure from his parents pressurizing him to marry girls from their respective families. Tired of their matchmaking he moves to the town where the heroine stays. Kota tells heroine that she will be married without telling her that he would be the groom. He tells heroine that the man who comes to her house on a specific day will be her husband, and Ramesh comes there by mistake. They both fall for each other. Kota is Ramesh's father's friend - and Ramesh tells him about",
    "release_date": "1991-08-09",
    "poster_path": null,
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-228341",
    "tmdb_id": 228341,
    "media_type": "movie",
    "title": "Thotti Gang",
    "overview": "Achi Babu (Allari Naresh), Sathi Babu (Sunil) and Suri Babu (Prabhu Deva) are the best buddies since childhood. They form a band that does multi purpose jobs like acting as band of boys for marriages, professional catchers of dogs, and cremation service guys. Karate Malliswari (Gajala), another childhood nightmarish karate-skill-flaunting damsel, lures Achi Babu into love. Then she snatches Achi Babu away from Suri Babu and Sathi Babu to make him her live-in boy friend. They also get engaged to each other. Irritated by their act, Suri Babu and Sathi Babu kidnap Malliswari. They tie her to a chair and then hatch another plan to make Achi Babu believe that Malliswari is dead. In that process, they dig a 'fresh' dead body from a crematorium, pack her in the car of Malliswari and throw that car into a valley. Police confirms that Malliswari is dead and Achi Babu's heart breaks again.",
    "release_date": "2002-12-06",
    "poster_path": "/o7NijrFatqj8zCscE8pLLSE7z1y.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-224953",
    "tmdb_id": 224953,
    "media_type": "movie",
    "title": "Style",
    "overview": "Ganesh (Prabhu Deva) is a good dancer. He beats Anthony in one dance competition to head into international arena. Anthony gets Ganesh beaten up, and Ganesh loses his legs in a car accident. He is depressed, but he wants to give his dance talent to someone and make him his heir. On a different line, Raghava (Raghava Lawrence) works as a boy at a dance school in Vizag. He and four of his friends are good dancers, but they are never recognized until one folk dance at a hotel. Ganesh finds his prospective heir in Raghava. The rest of the film is how Raghava prepares and defeats Anthony in the final dance competition.",
    "release_date": "2006-01-12",
    "poster_path": "/4E1QNgZK0UwbN6wnz861l2BLyl1.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-23788",
    "tmdb_id": 23788,
    "media_type": "movie",
    "title": "Anjaneyulu",
    "overview": "Employed with HMTV, Pavan/Abhimanyu lives in Hyderabad and is in constant touch with his retired father, Krishnamurthy, and mother. His boss, Sudarshan Babu, hires a Creative Consultant, Surya/Prabhakar Garu, their TV channel undergoes a number of changes, and he gets to interview various people. He meets with Anjali, an employee with Airtel, and both dramatically fall in love. While investigating corrupt politicians, he comes across evidence and decides to join the gang of a gangster named Bada. Still involved in gathering evidence, his world will come crashing around him when he will be told that his parents and many others have been killed after their bus was torched by hooligans. He sets out to also trace who was responsible behind their killing - not knowing that his life is also in danger.",
    "release_date": "2009-08-12",
    "poster_path": "/ves5gDgzAFXOqSSWKCyuom3f7l3.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-698345",
    "tmdb_id": 698345,
    "media_type": "movie",
    "title": "Ashwamedham",
    "overview": "Abhimanyu (Shobhan Babu) is an honest IPS officer who arrests an international mafia don smuggler Vyaghra (Amrish Puri), but Vyaghra somehow escapes from the prison. Kiriti (Nandamuri Balakrishna) is a pilot younger brother of Abhimanyu. With his brother's help; Abhimanyu kills Vyaghra. Then it is revealed that the person who has died is Anil Vyaghra who has a twin brother Sunil Vyaghra (also Amrish Puri) who owes to take revenge on the 2 brothers who are responsible for his brother's death. Anil Vyaghra proves that Abhimanyu is a corrupt officer, and has killed an honest man. Abhimanyu is arrested and he not able withstand the injustice, so he commits suicide. After that they inject poison in Kireeti's body and plan bomb blasts across India. Kireeti somehow stops the blasts from happening and kills all the baddie.",
    "release_date": "1992-12-25",
    "poster_path": "/kV8WI9zvXr5oGf7vFnCQ2saQ3qK.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-439057",
    "tmdb_id": 439057,
    "media_type": "movie",
    "title": "Nenu Local",
    "overview": "This story is about a happy-go-lucky young man, Babu, who falls in love with a girl. However, he runs into a problem while convincing her father to permit them to be together.",
    "release_date": "2017-02-03",
    "poster_path": "/2CjWcUIvoYFvvlm8773CYSnEYvA.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-307924",
    "tmdb_id": 307924,
    "media_type": "movie",
    "title": "Nuvvu Nenu",
    "overview": "Ravi (Uday Kiran) is the son of a multimillionaire in Hyderabad. Vasundhara (Anita), is the daughter of a milk supplier. Ravi and Vasundhara both study in the same college. The film starts with Vasundhara showing hatred towards Ravi, as he is a sportsman who is not good in his studies. Over a period of time, her hatred turns into love. Finally, they both fall in love, but their parents do not agree with their marriage. Parents plan to avoid the marriage by giving the couple a clause that they should not meet each other for one year. If their love remains even after one year then their parents would agree to let them marry.  Father of Ravi puts him under house arrest in Mumbai. While Vasundhara's father takes her to his hometown and arranges a forced marriage. However, both Ravi and Vasundhara manage to escape. The rest of the story is about how the pair unites against all odds.",
    "release_date": "2001-08-10",
    "poster_path": "/xoq7fb2cAxicALz7qqHE1IBhBBm.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-115045",
    "tmdb_id": 115045,
    "media_type": "movie",
    "title": "10th Class",
    "overview": "Srinu (Bharat) and Anjali (Sharanya) study tenth class in the same school. They fall in love with each other. Their friendship cum love thickens when they continue studying together in Intermediate. Later they get married and lead a family life. After initial struggling, Srinu gets a good job and Anjali gives birth to twins. But their happiness is short lived as Anjali dies in an accident. Srinu tries to commit suicide, but he is rescued by Sandhya (Sunaina). And how Srinu manage to lead his life without Anjali, forms the rest of the story.",
    "release_date": "2006-04-07",
    "poster_path": "/3TV0UI7scYkF7qWx6LN71SVHcrp.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-57010",
    "tmdb_id": 57010,
    "media_type": "movie",
    "title": "Ala Modalaindi",
    "overview": "Gowtam works as a reporter for a television channel. He is nursing a heart break after his girlfriend dumped him for another guy. He attends the wedding of his girlfriend where he meets the another girl Nitya dumped by the groom (her boy friend). They hit off well and become instant friends. Nitya stays in Bangalore and Gowtam stays in Hyderabad. They keep bumping in to each other over a period of years. Though both these people like each other, the fate intervenes to separate them at crucial moments. The rest of the story is all about how this couple finally realises that they are made for each other after few years of courtship.",
    "release_date": "2011-01-21",
    "poster_path": "/cKX4ySefAsNhMDb2TbjLyLBCsi3.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-115066",
    "tmdb_id": 115066,
    "media_type": "movie",
    "title": "Andarivaadu",
    "overview": "Andarivaadu (Telugu: అందరివాడు) is a 2005 Tollywood comedy film directed by Srinu Vytla. The film stars Chiranjeevi, Rimi Sen, Tabu and Prakash Raj. This movie was a hit.  Govinda Rajulu (Chiranjeevi) is a 'mesthri' who drinks a lot and lives a care-free life. His son Siddartha (Chiranjeevi), on the other hand, is a popular TV show host and is a more disciplined man — the opposite of his dad. The son gets his father married to Shanti (Tabu) to sober him.",
    "release_date": "2005-06-04",
    "poster_path": "/qcJFOOk3sWuTJYhJvirydu2UFED.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-1222479",
    "tmdb_id": 1222479,
    "media_type": "movie",
    "title": "Mirai",
    "overview": "Following the historic Kalinga battle, where King Ashoka of the Maurya dynasty emerged as the winner, he chose to walk the path of peace instead of continuing warfare. Yet, the kingdom appointed nine warriors to protect some ancient scriptures rumored to have the ability to make someone divine or godlike.",
    "release_date": "2025-09-12",
    "poster_path": "/gVzWHYThVODV5MgccDoyQxPFXve.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-23773",
    "tmdb_id": 23773,
    "media_type": "movie",
    "title": "Rechipo",
    "overview": "Siva (Nitin) is a thief. He robs the Peter to pay Paul on the lines of Robin hood. He always robs the black money from rich persons and spends it for the education of orphans and for a good cause. Siva robs Rs 500 crores from the Home Minister's house. While escaping under disguise he meets Krishnaveni (Ileana) and both fall in love. The rest of the story takes twists and turns where Krishnaveni is kidnapped by the mafia later to be saved by Siva.",
    "release_date": "2009-09-25",
    "poster_path": "/mUEwlb3u4GnWXmoTsk9FIBFlQDu.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-459713",
    "tmdb_id": 459713,
    "media_type": "movie",
    "title": "Mahanati",
    "overview": "Mahanati depicts the life and career of one of Telugu cinema's greatest and most iconic starlets, the first Indian female super star, Savitri.",
    "release_date": "2018-05-09",
    "poster_path": "/5hwtlwoLdSpkoeusT0sf8qW5VFB.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-39470",
    "tmdb_id": 39470,
    "media_type": "movie",
    "title": "Aa Okkati Adakku",
    "overview": "A fantasist, Chitti Babu spurns honest work after an astrologer tells his greatness will come after marriage. He snags the heart of millionaire Royyala Naidu's daughter, Rambha, but the pragmatic Rao sets a royal ransom: one lakh rupees before Chitti Babu touches his queen. The battle lines are drawn: son-in-law's harebrained schemes clash with father-in-law's cunning traps, all while Rambha navigates the chaos with love and exasperation. Will prophecy prevail, or will hard work win the day?",
    "release_date": "1992-09-19",
    "poster_path": "/43C6xck8XYG9UFPK4xWWzMm3wHE.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-137451",
    "tmdb_id": 137451,
    "media_type": "movie",
    "title": "Nee Kosam",
    "overview": "Sasirekha (Maheswari) is the daughter of a rich father (Jayaprakash Reddy), who is a strict disciplinarian and hates any kind of love affair. Ravi (Ravi Teja), an orphan, falls in love with Sasi and she also slowly develops feelings for Ravi. One day Ravi meets Sasi's father in the outskirts of the city and tells him all about his love. However, he is accidentally killed by Ravi in a scuffle. Sasi soon finds out that the real culprit is Ravi. Infuriated, she breaks up with him. Ravi, unable to bear the rejection, jumps from a hill. He escapes death, only to be told by the doctors that he is disabled and might be cured in the future if someone took care of him. In the climax, Sasi decides to stay with Ravi, who is nothing but a vegetable now, stating that what ever he did was just because of his love for her and she still is in love with him.  (Wikipedia -  Creative Commons Attribution-ShareAlike License)",
    "release_date": "1999-12-03",
    "poster_path": "/tUJmFiX5w8hOWYcX8mlCneR72v3.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "m-770906",
    "tmdb_id": 770906,
    "media_type": "movie",
    "title": "Salaar: Part 1 - Ceasefire",
    "overview": "Set in the fictional dystopian city-state of Khansaar, the film follows the friendship between Deva, a tribesman, and Varadha, the prince of Khansaar. When a coup d'état is planned by his father's ministers and his relatives, Varadha enlists Deva's help to become Khansaar's undisputed ruler.",
    "release_date": "2023-12-21",
    "poster_path": "/nlu9WbcetNFRGXXPWITr30ob7W6.jpg",
    "original_language": "te",
    "categories": [
      "telugu"
    ]
  },
  {
    "id": "t-200875",
    "tmdb_id": 200875,
    "media_type": "tv",
    "title": "IT: Welcome to Derry",
    "overview": "In 1962, a couple with their son move to Derry, Maine just as a young boy disappears. With their arrival, very bad things begin to happen in the town.",
    "release_date": "2025-10-26",
    "poster_path": "/nyy3BITeIjviv6PFIXtqvc8i6xi.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-66732",
    "tmdb_id": 66732,
    "media_type": "tv",
    "title": "Stranger Things",
    "overview": "When a young boy vanishes, a small town uncovers a mystery involving secret experiments, terrifying supernatural forces, and one strange little girl.",
    "release_date": "2016-07-15",
    "poster_path": "/uOOtwVbSr4QDjAGIifLDwpb2Pdl.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-71912",
    "tmdb_id": 71912,
    "media_type": "tv",
    "title": "The Witcher",
    "overview": "Geralt of Rivia, a mutated monster-hunter for hire, journeys toward his destiny in a turbulent world where people often prove more wicked than beasts.",
    "release_date": "2019-12-20",
    "poster_path": "/AoGsDM02UVt0npBA8OvpDcZbaMi.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-225171",
    "tmdb_id": 225171,
    "media_type": "tv",
    "title": "Pluribus",
    "overview": "The most miserable person on Earth must save the world from happiness.",
    "release_date": "2025-11-06",
    "poster_path": "/5TEwh75PYCDQaOXngknP62rpVrg.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-2734",
    "tmdb_id": 2734,
    "media_type": "tv",
    "title": "Law & Order: Special Victims Unit",
    "overview": "In the criminal justice system, sexually-based offenses are considered especially heinous. In New York City, the dedicated detectives who investigate these vicious felonies are members of an elite squad known as the Special Victims Unit. These are their stories.",
    "release_date": "1999-09-20",
    "poster_path": "/iofokHZoUB4Qhik4PflvJl8TT6a.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-1416",
    "tmdb_id": 1416,
    "media_type": "tv",
    "title": "Grey's Anatomy",
    "overview": "Follows the personal and professional lives of a group of doctors at Seattle’s Grey Sloan Memorial Hospital.",
    "release_date": "2005-03-27",
    "poster_path": "/hjJkrLXhWvGHpLeLBDFznpBTY1S.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-94954",
    "tmdb_id": 94954,
    "media_type": "tv",
    "title": "Hazbin Hotel",
    "overview": "In attempt to find a non-violent alternative for reducing Hell's overpopulation, the daughter of Lucifer opens a rehabilitation hotel that offers a group of misfit demons a chance at redemption.",
    "release_date": "2024-01-18",
    "poster_path": "/aVYHMW8pdzJ9qG1OGRMKyGy9xor.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-4614",
    "tmdb_id": 4614,
    "media_type": "tv",
    "title": "NCIS",
    "overview": "From murder and espionage to terrorism and stolen submarines, a team of special agents investigates any crime that has a shred of evidence connected to Navy and Marine Corps personnel, regardless of rank or position.",
    "release_date": "2003-09-23",
    "poster_path": "/mBcu8d6x6zB1el3MPNl7cZQEQ31.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-79744",
    "tmdb_id": 79744,
    "media_type": "tv",
    "title": "The Rookie",
    "overview": "Starting over isn't easy, especially for small-town guy John Nolan who, after a life-altering incident, is pursuing his dream of being an LAPD officer. As the force's oldest rookie, he’s met with skepticism from some higher-ups who see him as just a walking midlife crisis.",
    "release_date": "2018-10-16",
    "poster_path": "/bL1mwXDnH5fCxqc4S2n40hoVyoe.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-153312",
    "tmdb_id": 153312,
    "media_type": "tv",
    "title": "Tulsa King",
    "overview": "New York mafia capo Dwight \"The General\" Manfredi is released from prison after 25 years and exiled by his boss to set up shop in Tulsa, Oklahoma. Realizing that his mob family may not have his best interests in mind, Dwight slowly builds a crew.",
    "release_date": "2022-11-13",
    "poster_path": "/rOYLWCdAifpUtPlTf1WHxyaxeMt.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-250670",
    "tmdb_id": 250670,
    "media_type": "tv",
    "title": "Maxton Hall - The World Between Us",
    "overview": "When Ruby unwittingly witnesses an explosive secret at Maxton Hall private school, the arrogant millionaire heir James Beaufort has to deal with the quick-witted scholarship student for better or worse: He is determined to silence Ruby. Their passionate exchange of words unexpectedly ignites a spark...",
    "release_date": "2024-05-09",
    "poster_path": "/slKAbvY2CjAIyJFqoLSh1WICzg6.jpg",
    "original_language": "de",
    "categories": [
      "web_series"
    ]
  },
  {
    "id": "t-1622",
    "tmdb_id": 1622,
    "media_type": "tv",
    "title": "Supernatural",
    "overview": "When they were boys, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force. Subsequently, their father raised them to be soldiers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America ... and he taught them how to kill it. Now, the Winchester brothers crisscross the country in their '67 Chevy Impala, battling every kind of supernatural threat they encounter along the way. ",
    "release_date": "2005-09-13",
    "poster_path": "/u40gJarLPlIkwouKlzGdobQOV9k.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-1405",
    "tmdb_id": 1405,
    "media_type": "tv",
    "title": "Dexter",
    "overview": "Dexter Morgan, a blood spatter pattern analyst for the Miami Metro Police also leads a secret life as a serial killer, hunting down criminals who have slipped through the cracks of justice.",
    "release_date": "2006-10-01",
    "poster_path": "/q8dWfc4JwQuv3HayIZeO84jAXED.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-34307",
    "tmdb_id": 34307,
    "media_type": "tv",
    "title": "Shameless",
    "overview": "Chicagoan Frank Gallagher is the proud single dad of six smart, industrious, independent kids, who without him would be... perhaps better off. When Frank's not at the bar spending what little money they have, he's passed out on the floor. But the kids have found ways to grow up in spite of him. They may not be like any family you know, but they make no apologies for being exactly who they are.",
    "release_date": "2011-01-09",
    "poster_path": "/ifo31fMWLmyOVpdak9K0kY4jldQ.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-549",
    "tmdb_id": 549,
    "media_type": "tv",
    "title": "Law & Order",
    "overview": "In cases ripped from the headlines, police investigate serious and often deadly crimes, weighing the evidence and questioning the suspects until someone is taken into custody. The district attorney's office then builds a case to convict the perpetrator by proving the person guilty beyond a reasonable doubt. Working together, these expert teams navigate all sides of the complex criminal justice system to make New York a safer place.",
    "release_date": "1990-09-13",
    "poster_path": "/haJ9eHytVO3H3JooMJG1DiWwDNm.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-456",
    "tmdb_id": 456,
    "media_type": "tv",
    "title": "The Simpsons",
    "overview": "Set in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general.",
    "release_date": "1989-12-17",
    "poster_path": "/uWpG7GqfKGQqX4YMAo3nv5OrglV.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-244557",
    "tmdb_id": 244557,
    "media_type": "tv",
    "title": "Mahsun J",
    "overview": "Mahsun is a motorcycle courier in Istanbul. While searching for a way out of his life filled with debt, he accidentally discovers his \"greatest\" talent and decides to become a GIGOLO. Her manager will be her friend Leyla, who is a failed advertising executive.",
    "release_date": "2024-01-26",
    "poster_path": "/f6VrRlLqbWiGlhdBT658rWe1nLQ.jpg",
    "original_language": "tr",
    "categories": [
      "web_series"
    ]
  },
  {
    "id": "t-1434",
    "tmdb_id": 1434,
    "media_type": "tv",
    "title": "Family Guy",
    "overview": "Sick, twisted, politically incorrect and Freakin' Sweet animated series featuring the adventures of the dysfunctional Griffin family. Bumbling Peter and long-suffering Lois have three kids. Stewie (a brilliant but sadistic baby bent on killing his mother and taking over the world), Meg (the oldest, and is the most unpopular girl in town) and Chris (the middle kid, he's not very bright but has a passion for movies). The final member of the family is Brian - a talking dog and much more than a pet, he keeps Stewie in check whilst sipping Martinis and sorting through his own life issues.",
    "release_date": "1999-01-31",
    "poster_path": "/8o8kiBkWFK3gVytHdyzEWUBXVfK.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-272418",
    "tmdb_id": 272418,
    "media_type": "tv",
    "title": "Robin Hood",
    "overview": "A modern reimagining of the classic tale. After the Norman invasion of England, Rob, a Saxon forester’s son, and Marian, a Norman lord’s daughter, fall in love and unite to fight for justice, challenge corruption, and restore peace to the land.",
    "release_date": "2025-11-02",
    "poster_path": "/3teWChNzKJdbfen46IdeKTygdZa.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-1408",
    "tmdb_id": 1408,
    "media_type": "tv",
    "title": "House",
    "overview": "Dr. Gregory House, a drug-addicted, unconventional, misanthropic medical genius, leads a team of diagnosticians at the fictional Princeton–Plainsboro Teaching Hospital in New Jersey.",
    "release_date": "2004-11-16",
    "poster_path": "/3Cz7ySOQJmqiuTdrc6CY0r65yDI.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-1399",
    "tmdb_id": 1399,
    "media_type": "tv",
    "title": "Game of Thrones",
    "overview": "Seven noble families fight for control of the mythical land of Westeros. Friction between the houses leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war, a neglected military order of misfits, the Night's Watch, is all that stands between the realms of men and icy horrors beyond.",
    "release_date": "2011-04-17",
    "poster_path": "/1XS1oqL89opfnbLl8WnZY1O1uJx.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-210268",
    "tmdb_id": 210268,
    "media_type": "tv",
    "title": "Burn the House Down",
    "overview": "After her mother took the blame for a tragic fire 13 years ago, Anzu plots revenge by working as a housekeeper under a pseudonym for her icy stepmother.",
    "release_date": "2023-07-13",
    "poster_path": "/s4Ot7YP5GjEW8ggmjXbf79u6b2N.jpg",
    "original_language": "ja",
    "categories": [
      "web_series"
    ]
  },
  {
    "id": "t-4057",
    "tmdb_id": 4057,
    "media_type": "tv",
    "title": "Criminal Minds",
    "overview": "An elite team of FBI profilers analyze the country's most twisted criminal minds, anticipating their next moves before they strike again. The Behavioral Analysis Unit's most experienced agent is David Rossi, a founding member of the BAU who returns to help the team solve new cases.",
    "release_date": "2005-09-22",
    "poster_path": "/gigxjNnACiXAfrwoMox5WJFgc0I.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-46952",
    "tmdb_id": 46952,
    "media_type": "tv",
    "title": "The Blacklist",
    "overview": "Raymond \"Red\" Reddington, one of the FBI's most wanted fugitives, surrenders in person at FBI Headquarters in Washington, D.C. He claims that he and the FBI have the same interests: bringing down dangerous criminals and terrorists. In the last two decades, he's made a list of criminals and terrorists that matter the most but the FBI cannot find because it does not know they exist. Reddington calls this \"The Blacklist\". Reddington will co-operate, but insists that he will speak only to Elizabeth Keen, a rookie FBI profiler.",
    "release_date": "2013-09-23",
    "poster_path": "/4HTfd1PhgFUenJxVuBDNdLmdr0c.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-764",
    "tmdb_id": 764,
    "media_type": "tv",
    "title": "Midsomer Murders",
    "overview": "The peacefulness of the Midsomer community is shattered by violent crimes, suspects are placed under suspicion, and it is up to a veteran DCI and his young sergeant to calmly and diligently eliminate the innocent and ruthlessly pursue the guilty. ",
    "release_date": "1997-03-23",
    "poster_path": "/31wojXBSLT6LYTUMyc6BiyXqUyP.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-230318",
    "tmdb_id": 230318,
    "media_type": "tv",
    "title": "Открытый брак",
    "overview": "",
    "release_date": "2023-06-15",
    "poster_path": "/rFcLOQnqA4lUUo2hxvtkEj6tby7.jpg",
    "original_language": "ru",
    "categories": [
      "web_series"
    ]
  },
  {
    "id": "t-293613",
    "tmdb_id": 293613,
    "media_type": "tv",
    "title": "Physical: Asia",
    "overview": "Elite athletes from eight countries battle for national pride. After grueling tests of raw strength and endurance, only one flag can claim victory.",
    "release_date": "2025-10-28",
    "poster_path": "/osa3I6CuabnCEpNgFOvFMLLS7yP.jpg",
    "original_language": "ko",
    "categories": [
      "web_series"
    ]
  },
  {
    "id": "t-2224",
    "tmdb_id": 2224,
    "media_type": "tv",
    "title": "The Daily Show",
    "overview": "The World's Fakest News Team tackle the biggest stories in news, politics and pop culture.",
    "release_date": "1996-07-22",
    "poster_path": "/ixcfyK7it6FjRM36Te4OdblAq4X.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-59941",
    "tmdb_id": 59941,
    "media_type": "tv",
    "title": "The Tonight Show Starring Jimmy Fallon",
    "overview": "After Jay Leno's second retirement from the program, Jimmy Fallon stepped in as his permanent replacement. After 42 years in Los Angeles the program was brought back to New York.",
    "release_date": "2014-02-17",
    "poster_path": "/w45SzixehUuyVF4RY9aeNl3sFdc.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-2261",
    "tmdb_id": 2261,
    "media_type": "tv",
    "title": "The Tonight Show Starring Johnny Carson",
    "overview": "The Tonight Show Starring Johnny Carson is a talk show hosted by Johnny Carson under The Tonight Show franchise from 1962 to 1992. It originally aired during late-night. For its first ten years, Carson's Tonight Show was based in New York City with occasional trips to Burbank, California; in May 1972, the show moved permanently to Burbank, California. In 2002, The Tonight Show Starring Johnny Carson was ranked #12 on TV Guide's 50 Greatest TV Shows of All Time.",
    "release_date": "1962-10-01",
    "poster_path": "/uSvET5YUvHNDIeoCpErrbSmasFb.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-119051",
    "tmdb_id": 119051,
    "media_type": "tv",
    "title": "Wednesday",
    "overview": "Smart, sarcastic and a little dead inside, Wednesday Addams investigates twisted mysteries while making new friends — and foes — at Nevermore Academy.",
    "release_date": "2022-11-23",
    "poster_path": "/36xXlhEpQqVVPuiZhfoQuaY4OlA.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-1911",
    "tmdb_id": 1911,
    "media_type": "tv",
    "title": "Bones",
    "overview": "Dr. Temperance Brennan and her colleagues at the Jeffersonian's Medico-Legal Lab assist Special Agent Seeley Booth with murder investigations when the remains are so badly decomposed, burned or destroyed that the standard identification methods are useless.",
    "release_date": "2005-09-13",
    "poster_path": "/eyTu5c8LniVciRZIOSHTvvkkgJa.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-37680",
    "tmdb_id": 37680,
    "media_type": "tv",
    "title": "Suits",
    "overview": "While running from a drug deal gone bad, Mike Ross, a brilliant young college-dropout, slips into a job interview with one of New York City's best legal closers, Harvey Specter. Tired of cookie-cutter law school grads, Harvey takes a gamble by hiring Mike on the spot after he recognizes his raw talent and photographic memory.",
    "release_date": "2011-06-23",
    "poster_path": "/vQiryp6LioFxQThywxbC6TuoDjy.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-221079",
    "tmdb_id": 221079,
    "media_type": "tv",
    "title": "The Last Frontier",
    "overview": "When a prison transport plane crashes in the remote Alaskan wilderness—freeing dozens of violent inmates—the region's lone marshal must protect the town he's vowed to keep safe.",
    "release_date": "2025-10-09",
    "poster_path": "/4S2gS1mECZ5wDRBVAZE6KWmJHI3.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-1396",
    "tmdb_id": 1396,
    "media_type": "tv",
    "title": "Breaking Bad",
    "overview": "Walter White, a New Mexico chemistry teacher, is diagnosed with Stage III cancer and given a prognosis of only two years left to live. He becomes filled with a sense of fearlessness and an unrelenting desire to secure his family's financial future at any cost as he enters the dangerous world of drugs and crime.",
    "release_date": "2008-01-20",
    "poster_path": "/ztkUQFLlC19CCMYHW9o1zWhJRNq.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-1668",
    "tmdb_id": 1668,
    "media_type": "tv",
    "title": "Friends",
    "overview": "Six young people from New York City, on their own and struggling to survive in the real world, find the companionship, comfort and support they get from each other to be the perfect antidote to the pressures of life.",
    "release_date": "1994-09-22",
    "poster_path": "/2koX1xLkpTQM4IZebYvKysFW1Nh.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-4604",
    "tmdb_id": 4604,
    "media_type": "tv",
    "title": "Smallville",
    "overview": "The origins of the world’s greatest hero–from Krypton refugee Kal-el’s arrival on Earth through his tumultuous teen years to Clark Kent’s final steps toward embracing his destiny as the Man of Steel.",
    "release_date": "2001-10-16",
    "poster_path": "/r9K5QQv1o9pLKSEEbfoMWOQwLl5.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-1431",
    "tmdb_id": 1431,
    "media_type": "tv",
    "title": "CSI: Crime Scene Investigation",
    "overview": "A Las Vegas team of forensic investigators are trained to solve criminal cases by scouring the crime scene, collecting irrefutable evidence and finding the missing pieces that solve the mystery.",
    "release_date": "2000-10-06",
    "poster_path": "/i5hmoRjHNWady4AtAGICTUXknKH.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-5920",
    "tmdb_id": 5920,
    "media_type": "tv",
    "title": "The Mentalist",
    "overview": "Patrick Jane, a former celebrity psychic medium, uses his razor sharp skills of observation and expertise at \"reading\" people to solve serious crimes with the California Bureau of Investigation.",
    "release_date": "2008-09-23",
    "poster_path": "/acYXu4KaDj1NIkMgObnhe4C4a0T.jpg",
    "original_language": "en",
    "categories": [
      "web_series",
      "hollywood"
    ]
  },
  {
    "id": "t-65334",
    "tmdb_id": 65334,
    "media_type": "tv",
    "title": "Miraculous: Tales of Ladybug & Cat Noir",
    "overview": "Marinette and Adrien, two Parisian teenagers, are entrusted with powerful jewels in order to transform into superheroes Ladybug and Cat Noir. But neither hero knows the other's true identity — or that they're classmates!",
    "release_date": "2015-10-19",
    "poster_path": "/acrtAy8gmxcsEvrDP09MpMSCeDZ.jpg",
    "original_language": "fr",
    "categories": [
      "web_series"
    ]
  }
]